{"Story:\nAngie went to the library with her mother. First she had to turn in the books she was returning at the return desk. They said hello to the man there. He took their books. Then they went into the adult reading room. Angie sat in a brown chair at the table. She made a drawing of her mother. Her mother found a large red book. Then they went to the Mystery section. Angie sat in a blue chair. She drew a picture of her brother. Her mother found the book. It was a green book. Finally it was time to go to the children's room. It was Story Hour. Miss Hudson was there to read to all the children. She read a book about friendship. After the story Angie sat in the red chair and began drawing. They were drawing pictures of friends. Angie drew a picture of her best friend Lilly. Miss Hudson hung the pictures on the wall. Then Angie and her mother picked out 8 books to read at home. They checked the books out and went home.\nHistory:\nwhat did she draw?\nAmbiguous Question:\nwhat did her mother find? Clarifying Question: ": [" What section of the library did her mother find the book in?", " What did her mother find in the Mystery section?"], "Story:\nHave you ever tried broccoli ice cream? That's what Oliver serves his customers in the new movie Oliver's Organic Ice Cream. \nHistory:\nThe one-minute film was created by kids. A film is a movie. The young students learned their moviemaking skills at the Jacob Burns Film Center. The center is in Pleasantville, New York. Kids who go there learn how to make movies and music videos. \nAmbiguous Question:\nThe character Oliver and his treats are animated. In an animated movie, objects, such as ice cream and paper dolls, appear to be alive or moving.  Clarifying Question: ": [" Is Oliver's Organic Ice Cream in the movie Oliver's Organic Ice Cream animated?", " Does Oliver's Organic Ice Cream appear to be alive or moving in the movie Oliver's Organic Ice Cream?"], "Story:\nSilesia (; ; ; ; Silesian German: \"Schläsing\"; Silesian: \"Ślůnsk\" ; ; ; ) is a region of Central Europe located mostly in Poland, with small parts in the Czech Republic and Germany. Its area is about , and its population about 8,000,000. Silesia is located along the Oder River. It consists of Lower Silesia and Upper Silesia. \nHistory:\nThe region is rich in mineral and natural resources, and includes several important industrial areas. Silesia's largest city and historical capital is Wrocław. The biggest metropolitan area is the Upper Silesian metropolitan area, the centre of which is Katowice. Parts of the Czech city of Ostrava fall within the borders of Silesia. \nAmbiguous Question:\nSilesia's borders and national affiliation have changed over time, both when it was a hereditary possession of noble houses and after the rise of modern nation-states. The first known states to hold power there were probably those of Greater Moravia at the end of the 9th century and Bohemia early in the 10th century. In the 10th century, Silesia was incorporated into the early Polish state, and after its division in the 12th century became a Piast duchy. In the 14th century, it became a constituent part of the Bohemian Crown Lands under the Holy Roman Empire, which passed to the Austrian Habsburg Monarchy in 1526. Clarifying Question: ": ["\nWhat were the major changes to Silesia's borders and national affiliation throughout its history?", "\nWhat were the major changes in Silesia's borders and national affiliation throughout its history?"], "Story:\n(CNN) -- The driver of a Toyota Prius says he was taken on a wild ride Monday after the car's accelerator became stuck, reaching speeds in excess of 90 mph on a winding, hilly portion of a southern California interstate. \nHistory:\nIt took the California Highway Patrol to bring the car safely to a stop. \nAmbiguous Question:\nThe driver, Jim Sikes, said he was traveling east on Interstate 8 outside of the San Diego area when he attempted to pass a slower vehicle.  Clarifying Question: ": [" What was the speed of the slower vehicle that Jim Sikes attempted to pass?", " What direction was the Toyota Prius traveling when the accelerator became stuck, S for south or t for north?"], "Story:\nThe Human Development Index (HDI) is a composite statistic of life expectancy, education, and income per capita indicators, which are used to rank countries into four tiers of human development. A country scores higher HDI when the life expectancy at birth is longer, the education period is longer, and the income per capita is higher. The HDI was developed by the Pakistani economist Mahbub ul Haq, often framed in terms of whether people are able to \"be\" and \"do\" desirable things in their life, and was published by the United Nations Development Programme. \nHistory:\nThe 2010 Human Development Report introduced an Inequality-adjusted Human Development Index (IHDI). While the simple HDI remains useful, it stated that \"the IHDI is the actual level of human development (accounting for inequality),\" and \"the HDI can be viewed as an index of 'potential' human development (or the maximum IHDI that could be achieved if there were no inequality).\"\nAmbiguous Question:\nand another? Clarifying Question: ": ["\nWhat is the difference between the HDI and the IHDI?", "\nWhat is the difference between the HDI and the IHDI?"], "Story:\nSouth Georgia and the South Sandwich Islands (SGSSI) is a British overseas territory in the southern Atlantic Ocean. It is a remote and inhospitable collection of islands, consisting of South Georgia and a chain of smaller islands known as the South Sandwich Islands. South Georgia is long and wide and is by far the largest island in the territory. The South Sandwich Islands lie about southeast of South Georgia. The territory's total land area is . The Falkland Islands are about north-west from its nearest point. \nHistory:\nThere is no permanent population on the islands. The present inhabitants are the British Government Officer, Deputy Postmaster, scientists, and support staff from the British Antarctic Survey who maintain scientific bases at Bird Island and at the capital, King Edward Point, as well as museum staff at nearby Grytviken. \nAmbiguous Question:\nThe United Kingdom claimed sovereignty over South Georgia in 1775 and the South Sandwich Islands in 1908. The territory of \"South Georgia and the South Sandwich Islands\" was formed in 1985; previously it had been governed as part of the Falkland Islands Dependencies. Argentina claimed South Georgia in 1927 and claimed the South Sandwich Islands in 1938.  Clarifying Question: ": ["\nWhat is the current status of Argentina's claims over South Georgia and the South Sandwich Islands?", "\nWhich two countries have claimed sovereignty over South Georgia and the South Sandwich Islands?"], "Story:\nLouisville ( , or ) is the largest city in the Commonwealth of Kentucky and the 29th-most populous city in the United States. It is one of two cities in Kentucky designated as first-class, the other being the state's second-largest city of Lexington. Louisville is the historical seat and, since 2003, the nominal seat of Jefferson County. \nHistory:\nLouisville was founded in 1778 by George Rogers Clark and is named after King Louis XVI of France, making Louisville one of the oldest cities west of the Appalachian Mountains. Sited beside the Falls of the Ohio, the only major obstruction to river traffic between the upper Ohio River and the Gulf of Mexico, the settlement first grew as a portage site. It was the founding city of the Louisville and Nashville Railroad, which grew into a system across 13 states. Today, the city is known as the home of the Kentucky Derby, Kentucky Fried Chicken, the University of Louisville and its Louisville Cardinals athletic teams, Louisville Slugger baseball bats, and three of Kentucky's six \"Fortune\" 500 companies. Its main airport is also the site of United Parcel Service's worldwide air hub. \nAmbiguous Question:\nSince 2003, Louisville's borders have been the same as those of Jefferson County because of a city-county merger. The official name of this consolidated city-county government is the Louisville/Jefferson County Metro Government, abbreviated to Louisville Metro. Despite the merger and renaming, the term \"Jefferson County\" continues to be used in some contexts in reference to Louisville Metro, particularly including the incorporated cities outside the \"balance\" which make up Louisville proper. The city's total consolidated population as of the 2014 census estimate was 760,026. However, the balance total of 612,780 excludes other incorporated places and semiautonomous towns within the county and is the population listed in most sources and national rankings. Clarifying Question: ": ["\nWhat is the total population of Louisville Metro, including all incorporated places and semiautonomous towns within the county?", "\nWhat is the total population of Louisville Metro, including all incorporated places and semiautonomous towns within Jefferson County?"], "Story:\nMy Left Foot (1989) Imagine being a prisoner of your own body, unable to make any movements except to move your left foot. The main character in My Left Foot, based on the real story of cerebral palsy sufferer Christy Brown, can barely move his mouth to speak, but by controlling his left foot, he's able to express himself as an artist and poet. For his moving performance of Brown, Daniel Lewis won his first Academy Award for best actor. Shine (1996) Do you have a talent you're afraid to share with the world? David Helfgott seemed meant from childhood to be \"one of the truly great pianists,\" but the pressures of performing (and pleasing his father) resulted in a complete breakdown. Ten years in a mental institution didn't weaken Helfgott's musical gift: When he was rediscovered, he was playing concertos in a bar. Shine received s even Oscar nominations , and Geoffrey Rush won best actor for his performance of Helfgott. Life Is Beautiful (1997) Nothing's more powerful than the love between a parent and a child. In this heartbreaking Italian film, a father (Roberto Benigni) makes an unbelievable sacrifice for his 4-year-old son: trapped in a Nazi concentration camp in 1945, the Jewish man convinces his boy that they are playing a complicated game. He manages to spare him the horror of the terrible war, and even in his final moments of life, keeps his son smiling and hopeful. Benigni won the best actor Oscar. Stand and Deliver (1988) Few people can inspire us more than a good teacher. Jaime Escalante (Edward James Olmos got Oscar nomination for best actor) is a great one. Employed at a high school where kids are expected to fail, Escalante challenges his math students to struggle for better things, like getting good grades in the AP exam. Despite the obstacles in their lives, the classmates accomplish their goals, thanks to Mr. Escalante's support. The real Jaime Escalante, the Best Teacher in America, says that Stand and Deliver is \" 90% truth, 10% drama.\"\nHistory:\nWas there an example?\nAmbiguous Question:\nWas there a movie made of it? Clarifying Question: ": [" Was there a movie made about the real story of Christy Brown, Jaime Escalante, David Helfgott, or Roberto Benigni?", "\nWas there a movie made about any of the stories mentioned?"], "Story:\nThe Independent is a British online newspaper. Established in 1986 as an independent national morning newspaper published in London, it was controlled by Tony O'Reilly's Independent News & Media from 1997 until it was sold to Russian oligarch Alexander Lebedev in 2010. The last printed edition of \"The Independent\" was published Saturday 20 March 2016, leaving only its digital editions. \nHistory:\nNicknamed the \"Indy\", it began as a broadsheet, but changed to tabloid (compact) format in 2003. Until September 2011, the paper described itself on the banner at the top of every newspaper as \"free from party political bias, free from proprietorial influence\". It tends to take a pro-market stance on economic issues. \nAmbiguous Question:\nThe daily edition was named \"National Newspaper of the Year\" at the 2004 British Press Awards.  Clarifying Question: ": [" What was the format of the newspaper when it was awarded National Newspaper of the Year in 2004?", " What type of award was the \"National Newspaper of the Year\" at the 2004 British Press Awards?"], "Story:\nThe Silurian is a geologic period and system spanning 24.6 million years from the end of the Ordovician Period, at million years ago (Mya), to the beginning of the Devonian Period, Mya. As with other geologic periods, the rock beds that define the period's start and end are well identified, but the exact dates are uncertain by several million years. The base of the Silurian is set at a major Ordovician–Silurian extinction events when 60% of marine species were wiped out. \nHistory:\nA significant evolutionary milestone during the Silurian was the diversification of jawed and bony fish. Multi-cellular life also began to appear on land in the form of small, bryophyte-like and vascular plants that grew beside lakes, streams, and coastlines, and terrestrial arthropods are also first found on land during the Silurian. However, terrestrial life would not greatly diversify and affect the landscape until the Devonian. \nAmbiguous Question:\nThe Silurian system was first identified by British geologist Roderick Murchison, who was examining fossil-bearing sedimentary rock strata in south Wales in the early 1830s. He named the sequences for a Celtic tribe of Wales, the Silures, inspired by his friend Adam Sedgwick, who had named the period of his study the Cambrian, from the Latin name for Wales. This naming does not indicate any correlation between the occurrence of the Silurian rocks and the land inhabited by the Silures. In 1835 the two men presented a joint paper, under the title \"On the Silurian and Cambrian Systems, Exhibiting the Order in which the Older Sedimentary Strata Succeed each other in England and Wales,\" which was the germ of the modern geological time scale. As it was first identified, the \"Silurian\" series when traced farther afield quickly came to overlap Sedgwick's \"Cambrian\" sequence, however, provoking furious disagreements that ended the friendship. Charles Lapworth resolved the conflict by defining a new Ordovician system including the contested beds. An early alternative name for the Silurian was \"\"Gotlandian\"\" after the strata of the Baltic island of Gotland. Clarifying Question: ": ["\nWhat evidence did Roderick Murchison and Adam Sedgwick use to identify the Silurian and Cambrian systems?", "\nWhat was the origin of the name \"Silurian\" and what were the disagreements between Murchison and Sedgwick that led to the creation of the Ordovician system?"], "Story:\nJohn and Bobby joined the same company together just after graduation from college the same year. Both worked very hard. After several years, however, the boss promoted Bobby to the position of manager but John remained an ordinary worker. John couldn't \nHistory:\nit anymore, gave his resignation to the boss and complained that the boss only promoted those who only said good words to him. \nAmbiguous Question:\nThe boss knew John worked very hard for the years. He thought for a moment and said, \"I hope you will do one more thing for our company before you leave.\"  Clarifying Question: ": [" What did the boss ask John to do before leaving the company?", " What did the boss ask John to do for the company before he left?"], "Story:\n(CNN) -- A court in Fulton County, Georgia, has temporarily stopped the scheduled Monday night execution of condemned murderer Warren Hill. \nHistory:\nHill was sentenced to death for the 1990 killing of Joseph Handspike, another inmate in a Georgia state prison. \nAmbiguous Question:\nHe was convicted of beating Handspike to death with a nail-studded board while serving a life sentence in the 1985 killing of his girlfriend, Myra Wright. His lawyers have argued that Hill is mentally retarded.  Clarifying Question: ": [" What was the evidence used to determine that Hill was mentally retarded?", " Was Hill convicted of killing Handspike and Wright?"], "Story:\nTony was riding his bike home from school. Then he saw Cindy riding her bike in front of him. \nHistory:\nTony yelled, \"Hey, Cindy!\" Then he rode faster to catch up with her. \nAmbiguous Question:\nCindy said, \"Tony! Hey! Where are you going?\"  Clarifying Question: ": [" What was Tony's response when Cindy asked him where he was going?", " Where was Tony going when he yelled \"Hey, Cindy\"?"], "Story:\nSanta Claus makes sure that every year at Christmas time that his reindeer are ready to deliver gifts to girls and boys all over the world. Without the reindeer, how would Santa fly from home to home? The most important thing that Santa has to do for the reindeer is to make sure they have their coffee on Christmas Eve. Without the coffee, they won't stay awake for very long. Sleeping reindeer are not very helpful. Santa also gives the reindeer candy to keep up their energy. In the North Pole, the main candy is candy canes in red and white. Reindeer love the candy canes that are different colors best and Santa says that helps them fly faster. Next, Santa has to make sure that the reindeer have a good meal before they go. Santa wants to make sure he doesn't have to share the cookies kids leave for him. The last thing Santa has to do is make sure the reindeer know where they are going. Santa has only been lost one time on Christmas Eve and he does not want that to happen again.\nHistory:\nWhat candy does he feed them most often?\nAmbiguous Question:\nHow many times has he been lost? Clarifying Question: ": ["\nHow many times has Santa been lost on Christmas Eve?", "\nHow many times has Santa been lost on Christmas Eve?"], "Story:\nSudha Chandran, a classical dancer from India, had to have her right leg cut after a car accident.She was also cut off on her bright career road. \nHistory:\nHowever, she didn't stop struggling. In the painful three months that followed, Sudha met a doctor who had an operation on her leg. So strongly she wanted to go back to dancing after she had been fitted with a man-made leg. Sudha knew that she believed in herself and could realize her dream,so she began her brave journey back to the world of dancing -- learning to balance, bend, stretch,walk, and turn. \nAmbiguous Question:\nAfter every public recital , she might ask her dad about her performance. \"You stillhave a long way to go\" was the answer she used to get in return. In January 1984, Sudha gained popularity again by giving a public recital in Bombay. She performed in such a great manner that it moved everyone to tears and this performance pushed her to the number one position again. That evening when she asked her dad the same question, he didn't say anything. He just touched her feet as a praise.  Clarifying Question: ": [" What did Sudha's father do to express his approval of her performance?", "\nWhat did Sudha's father do when she asked him about her performance after the public recital in January 1984?"], "Story:\n(CNN) -- The fledgling International Premier Tennis League suffered a blow when two of the world's most recognized female athletes snubbed the event. \nHistory:\nMax Eisenbud, the agent of both Maria Sharapova and Li Na, told CNN on Thursday that neither would be appearing in the team tournament that is set to make its debut in Asia this November. \nAmbiguous Question:\nSharapova transcends tennis and has long been a magnet for sponsors -- the Russian is perennially listed as the world's richest female athlete by Forbes -- while China's Li is one of the marquee names in Asia, having captured a second grand slam title at the Australian Open in January.  Clarifying Question: ": [" What is the International Premier Tennis League?", " What was the reason given by Eisenbud for Sharapova and Li not appearing in the International Premier Tennis League?"], "Story:\nCHAPTER TWENTY TWO. \nHistory:\nTHE PIGS' CURE. \nAmbiguous Question:\nIt was not long before our hero recovered from his delirium. Leading, as he had been doing, an abstemious and healthy life, ordinary disease could not long maintain its grasp of him. His superabundant life seemed to cast it off with the ease with which his physical frame was able to cast aside human foes. But he could not thus shake off the leprosy.  Clarifying Question: ": [" How did the protagonist's superabundant life help him to recover from his delirium?", " What did our hero do to try to cure himself of leprosy?"], "Story:\nJoe was in his bedroom. He was reading a book that his teacher gave him. The book was titled, \"Everything You'd Want to Know About Fish.\" He was reading the book because he was interested in learning more about fish. Joe thought reading the book was fun. He liked to imagine himself swimming with fish he read about in the book. Also, he liked looking at the pictures. \nHistory:\nJoe's mother called him. Joe closed the book, and went downstairs. He asked his mother, \"Do you need something?\" \nAmbiguous Question:\nAnd his mother said, \"Joe, it's time for dinner.\" Clarifying Question: ": [" What did Joe's mother say when she called him?", "\nWhat was the last thing Joe was doing before his mother called him?"], "Story:\nCHAPTER XI \nHistory:\nTHE MAN AT THE ASTOR \nAmbiguous Question:\nThe duties of Master Pugsy Maloney at the offices of _Cosy Moments_ were not heavy; and he was accustomed to occupy his large store of leisure by reading narratives dealing with life in the prairies, which he acquired at a neighbouring shop at cut rates in consideration of their being shop-soiled. It was while he was engrossed in one of these, on the morning following the visit of Mr. Parker, that the seedy-looking man made his appearance. He walked in from the street, and stood before Master Maloney.  Clarifying Question: ": [" What was the name of the book Master Maloney was reading when the seedy-looking man arrived?", " What was the name of the shop from which Master Maloney purchased his prairie stories?"], "Story:\n\"Show them the money!\" That's what some people are saying for college athletes. They say students who play sports for their school should receive salaries. \nHistory:\nTop athletes should be paid because many of them practice full time, Mark Jameson argues. Rico Cannon, a former college football player, agrees. \"Nonathletes can get a job for extra spending money, but many student athletes spend so many hours in training that they don't have time to work,\" he explains. \"Shouldn't athletes be able to earn extra money too?\" \nAmbiguous Question:\nThe students also make money for their schools when people buy tickets to their games. The players should receive some of that cash, supporter Robbie Pokora reasons.  Clarifying Question: ": [" How much money should college athletes receive for playing sports?", " How much of the money generated from ticket sales should the players receive?"], "Story:\nCHAPTER IV--PAUL BLACKTHORN \nHistory:\n'I say,' cried Harold, running up into his brother's room, as soon as he had put away the pony, 'do you know whether Paul is gone?' \nAmbiguous Question:\n'It is always Paul, Paul!' exclaimed Ellen; 'I'm sure I hope he is.'  Clarifying Question: ": [" Where has Paul gone?", " What is Paul's last name?"], "Story:\n(CNN) -- Hilary Duff says her new album is \"very positive\" but admits that it started out \"a lot heavier and a lot darker\" because of the separation from her husband, Mike Comrie. \nHistory:\n\"I'm separated from my husband right now, which has been a very difficult thing to go through,\" she told Billboard's \"Pop Shop\" podcast. \"In the beginning, the album was a lot heavier and a lot darker, because I had to get that out. Once I did get that out, a lot of fun came.\" \nAmbiguous Question:\nDuff married Comrie, a former pro hockey player, in 2010 after dating for three years. Their son, Luca, was born in 2012. Duff and Comrie announced their separation in January.  Clarifying Question: ": [" What was the reason for the separation between Hilary Duff and Mike Comrie?", " What is the current status of Hilary Duff and Mike Comrie's relationship?"], "Story:\nHow to react to Iran's new smiley-faced president, Hassan Rouhani? \nHistory:\nSmile back, but don't stop squeezing Iran with sanctions. \nAmbiguous Question:\nRouhani has offered a series of positive gestures since taking office in early August. He has released some political prisoners. He sent New Year's greetings to Jews in Iran and around the world. He took a phone call from the president of the United States.  Clarifying Question: ": ["\nWhat is the best way to respond to Rouhani's positive gestures in order to continue to pressure Iran with sanctions?", "\nWhat is the best way to respond to Rouhani's positive gestures while maintaining sanctions on Iran?"], "Story:\nMaterialism is a form of philosophical monism which holds that matter is the fundamental substance in nature, and that all phenomena, including mental phenomena and consciousness, are identical with material interactions. \nHistory:\nMaterialism is closely related to physicalism, the view that all that exists is ultimately physical. Philosophical physicalism has evolved from materialism with the discoveries of the physical sciences to incorporate more sophisticated notions of physicality than mere ordinary matter, such as: spacetime, physical energies and forces, dark matter, and so on. Thus the term \"physicalism\" is preferred over \"materialism\" by some, while others use the terms as if they are synonymous. \nAmbiguous Question:\nMaterialism belongs to the class of monist ontology. As such, it is different from ontological theories based on dualism or pluralism. For singular explanations of the phenomenal reality, materialism would be in contrast to idealism, neutral monism, and spiritualism.  Clarifying Question: ": [" What is the difference between materialism and other ontological theories?", " What is the difference between materialism and other ontological theories?"], "Story:\nShanghai is one of the four direct-controlled municipalities of China and the most populous city proper in the world with a population of more than 24 million . It is a global financial centre and transport hub, with the world's busiest container port. Located in the Yangtze River Delta, it sits on the south edge of the estuary of the Yangtze in the middle portion of the East China coast. The municipality borders the provinces of Jiangsu and Zhejiang to the north, south and west, and is bounded to the east by the East China Sea. \nHistory:\nAs a major administrative, shipping and trading city, Shanghai grew in importance in the 19th century due to trade and recognition of its favourable port location and economic potential. The city was one of five treaty ports forced open to foreign trade following the British victory over China in the First Opium War. The subsequent 1842 Treaty of Nanking and 1844 Treaty of Whampoa allowed the establishment of the Shanghai International Settlement and the French Concession. The city then flourished as a centre of commerce between China and other parts of the world (predominantly Western countries), and became the primary financial hub of the Asia-Pacific region in the 1930s. However, with the Communist Party takeover of the mainland in 1949, trade was limited to other socialist countries, and the city's global influence declined. In the 1990s, the economic reforms introduced by Deng Xiaoping resulted in an intense re-development of the city, aiding the return of finance and foreign investment to the city.\nAmbiguous Question:\nWhat happened to international trade then? Clarifying Question: ": ["\nWhat changes occurred to Shanghai's international trade after the Communist Party takeover of the mainland in 1949?", "\nWhat changes to international trade occurred in Shanghai after the Communist Party takeover of the mainland in 1949?"], "Story:\nCHAPTER IV \nHistory:\nKARI \nAmbiguous Question:\nThus began my life in London in the house of my uncle, John Grimmer, who was called the Goldsmith. In truth, however, he was more than this, since not only did he fashion and trade in costly things; he lent out moneys to interest upon security to great people who needed it, and even to the king Richard and his Court. Also he owned ships and did much commerce with Holland, France, yes, and with Spain and Italy. Indeed, although he appeared so humble, his wealth was very large and always increased, like a snowball rolling down a hill; moreover, he owned much land, especially in the neighbourhood of London where it was likely to grow in value.  Clarifying Question: ": [" What kind of business did John Grimmer do to increase his wealth?", " What type of business did John Grimmer conduct?"], "Story:\nThe Apollo program, also known as Project Apollo, was the third United States human spaceflight program carried out by the National Aeronautics and Space Administration (NASA), which accomplished landing the first humans on the Moon from 1969 to 1972. First conceived during Dwight D. Eisenhower's administration as a three-man spacecraft to follow the one-man Project Mercury which put the first Americans in space, Apollo was later dedicated to President John F. Kennedy's national goal of \"landing a man on the Moon and returning him safely to the Earth\" by the end of the 1960s, which he proposed in a May 25, 1961, address to Congress. Project Mercury was followed by the two-man Project Gemini (1962–66). The first manned flight of Apollo was in 1968. \nHistory:\nApollo ran from 1961 to 1972, and was supported by the two-man Gemini program which ran concurrently with it from 1962 to 1966. Gemini missions developed some of the space travel techniques that were necessary for the success of the Apollo missions. Apollo used Saturn family rockets as launch vehicles. Apollo/Saturn vehicles were also used for an Apollo Applications Program, which consisted of Skylab, a space station that supported three manned missions in 1973–74, and the Apollo–Soyuz Test Project, a joint Earth orbit mission with the Soviet Union in 1975.\nAmbiguous Question:\nApollo was dedicated to which president's goal? Clarifying Question: ": ["\nWhich president proposed the goal of \"landing a man on the Moon and returning him safely to the Earth\" in 1961?", "\nWhich president proposed the goal of landing a man on the Moon and returning him safely to the Earth by the end of the 1960s?"], "Story:\nYesterday I started the Year of Giving, my first day of a year-long journey into exploring the act of giving and the meaning of charity. I chose December 15 as the starting date, which marked three years since my mother died from heart disease. She was one of the most generous people that I have ever known. She always thought of others first and certainly serves as an inspiration to me. \nHistory:\nI had a rather busy day yesterday, ironic for someone who is unemployed right now. In the morning I went to the gym, and unsuccessfully got the phone call from the unemployment office for some job searching. Before I knew it, it was noon. I grabbed a quick lunch and rushed down to a meeting. On my way to Connecticut, I wondered if I would see someone that I would feel forced to give my first $10 to. I was running late and decided to do it afterwards. \nAmbiguous Question:\nAfter the meeting I had about half an hour to find the first person of my Year of Giving! I decided to check out Dupont Circle. I had met a guy there named Jerry once and thought he would willingly accept my first $10. He wasn't there, but I did see a man sitting by himself who looked really lonely, so I approached him. Now I had to figure out what I was going to say. I think I said something like, \"Hi, can I sit down here?\" \"I would like to know if I could give you $10?\" He asked me to repeat what I had said. I did, then he looked at me funny, got up and left.  Clarifying Question: ": [" What was the man's response when the speaker asked if he could give him $10?", " What did the man do after I asked if I could give him $10?"], "Story:\nIslamabad, Pakistan (CNN) -- The Pakistani Taliban vowed Thursday to carry out attacks against India to avenge the death of a man executed by Indian authorities for his role in the 2008 terrorist assault on Mumbai. \nHistory:\nMohammed Ajmal Kasab, a Pakistani, was hanged Wednesday in Pune, a city southeast of Mumbai. He was the lone surviving gunman from the attacks in India's financial capital in November 2008 that killed more than 160 people. \nAmbiguous Question:\nRead more: Who are the Pakistani Taliban?  Clarifying Question: ": ["\nWhat actions has the Pakistani Taliban vowed to take in response to the execution of Mohammed Ajmal Kasab?", "\nWhat is the relationship between the Pakistani Taliban and the execution of Mohammed Ajmal Kasab?"], "Story:\nMike wanted to make a cake for his Mom's birthday. His dad was going to help him. Mike had eggs, milk, and flour at his house, but no sugar! Dad told Mike to take his bicycle to the store so he could buy sugar for the cake. On his way to the store, Mike saw his friend, Sally, at the park. He rode over to say hello. Mike and Sally played lots of games at the park. After a long time, Mike saw it was starting to get dark. He needed to hurry if he was going to make it to the store and get home before night time. Mike rode as fast as he could, and made it to the store. The store was really big, but Mike found the sugar really fast. When Mike was on his way to the front of the store to pay for the sugar, he saw a toy he had been wanting for a long time. But Mike only had enough money to pay for the sugar or the toy. Mike didn't know what to do! The cake would taste good and would make his mom happy. But, the toy was so cool! Mike bought the sugar for his mom's cake, because she was always so nice to him. He could always get the toy another time. \nHistory:\n\nAmbiguous Question:\n2. What did Mike find at the store that he wanted to buy Clarifying Question: ": ["\nWhat was the toy that Mike saw at the store that he wanted to buy?", "\nWhat toy did Mike see at the store that he wanted to buy?"], "Story:\nJohn was in the third grade, and nine years old. Every day he had to walk home from school. There were some kids in his class who were mean to him, and during the winter they would throw snowballs at him. John could have told the teacher, but one of the kids was a very pretty girl. She was mean, but John liked her because she was pretty and did not want her to get in trouble. \nHistory:\nOne day, his teacher asked John to stay after class to wipe off the chalkboard and to empty the pencil sharpener. By the time he was done, the other kids had gone home. They could no longer throw snowballs at him. John did not mind helping out his teacher, and he soon stayed after class every day. \nAmbiguous Question:\nJohn was not very good at math, and sometimes his teacher would help him when he stayed after school. She said if John could help her out for at least two weeks, he could pass his math class. John thought it was a good deal, and ended up being much better at math. Clarifying Question: ": ["\nWhat did John have to do for his teacher in exchange for passing his math class?", "\nWhat did John have to do for his teacher in exchange for being able to pass his math class?"], "Story:\nOnce upon a time, there was a squirrel named Joey. Joey loved to go outside and play with his cousin Jimmy. Joey and Jimmy played silly games together, and were always laughing. One day, Joey and Jimmy went swimming together at their Aunt Julie's pond. Joey woke up early in the morning to eat some food before they left. He couldn't find anything to eat except for pie! Usually, Joey would eat cereal, fruit (a pear), or oatmeal for breakfast. After he ate, he and Jimmy went to the pond. On their way there they saw their friend Jack Rabbit. They dove into the water and swam for several hours. The sun was out, but the breeze was cold. Joey and Jimmy got out of the water and started walking home. Their fur was wet, and the breeze chilled them. When they got home, they dried off, and Jimmy put on his favorite purple shirt. Joey put on a blue shirt with red and green dots. The two squirrels ate some food that Joey's mom, Jasmine, made and went off to bed.\nHistory:\nWere they happy?\nAmbiguous Question:\nWhere did they go? Clarifying Question: ": ["\nWhere did Joey and Jimmy go when they left the pond?", "\nWhere did Joey and Jimmy go after they got out of the water?"], "Story:\nClaude Monet is surely one of the most famous French artists of all. Monet was particularly interested in the effect of light and would paint the same scene in different lighting conditions or times of the day. For example, he painted around 20 versions of the Rouen Cathedral from dawn to dusk. His most famous paintings include his Water lilies series. \nHistory:\nThe paintings of Paul Cezanne had a lot of influence in the development of 20th century art, including Cubism and Fauvism . Cezanne is one of the most famous French artists and is known as a \"post-impressionist\", which was similar in some ways to impressionism but also broke away from some of its limitations. Famous French paintings include his Bathers and Mont St Victoire series. \nAmbiguous Question:\nHenri Matisse was one of the most important famous French artists of the 20th century. He was considered one of the leaders of the Fauvist movement. He had a long and varied artistic career, painting in different styles ranging from Impressionism to Abstract. In 1941, Matisse was diagnosed with cancer and was forced into a wheelchair. But this didn't stop him completing the amazing Chapel of the Rosary in Vence.  Clarifying Question: ": [" What type of art did Henri Matisse create?", " What style of art was Matisse primarily known for?"], "Story:\nWang Bing is a 12-year-old boy. He likes sports very much and does well in sports. One afternoon, he comes out of the classroom and sees his father waiting for him at the school gate. He is very glad and he runs to his father. \"Dad, please don't wait for me after school next time. I can go home by myself . I have grown up.\" says Wang Bing. \"Let's go,\" says the father, \"I'll cook supper and you can do your homework at home: Mum is still at work.\"On their way home, Wang Bing sees some boys skating in a park. \"Can I go and learn skating. Dad?\" asks Wang Bing. \"I'm sorry, my boy. You must go home and do your homework,\" answers his father, \"but I can buy you an ice-cream.\" Then his father buys an ice-cream for him. When Wang Bing wants to eat it, a fly flies to the ice-cream. \"Drive off the fly,' says his father, \"it's very dirty .\"But Wang Bing says with a smile. \"You don't let me skate, but can you let him skate for a while ?\"\nHistory:\nwhy not?\nAmbiguous Question:\nWho meets him for his excursion? Clarifying Question: ": [" Who is waiting for Wang Bing at the school gate when he comes out of the classroom?", " Who is waiting for Wang Bing at the school gate?"], "Story:\nChristopher Thomas, 27, was a writer by night and a teacher by day when he noticed he was always tired and was losing weight fast. Diagnosed with diabetes , Thomas would need to inject himself with insulin three times a day for the rest of his life or risk nerve damage, blindness, and even death. And if that weren't bad enough, he had no health insurance. After a month of feeling upset, Thomas decided he'd better find a way to fight back. He left Canton, Michigan for New York, got a job waiting tables, nicknamed himself the Diabetic Rockstar , and created diabeticrockstar.com, a free online community for diabetics and their loved ones--a place where over 1,100 people share personal stories, information, and resources. \nHistory:\nJason Swencki\"s son, Kody, was diagnosed with type diabetes at six. Father and son visit the online children's forums together most evenings. \"Kody gets so excited, writing to kids from all over,\" says Swencki, one of the site's volunteers. \"They know what he's going through, so he doesn't feel alone.\" Kody is anything but alone: Diabetes is now the seventh leading cause of death in the United States, with 24 million diagnosed cases. And more people are being diagnosed at younger ages. \nAmbiguous Question:\nThese days, Thomas's main focus is his charity, Fight It, which provides medicines and supplies to people--225 to date--who can't afford a diabetic's huge expenses. Fight-it.org has raised about $23,000--in products and in cash. In May, Thomas will hold the first annual Diabetic Rockstar Festival in the Caribbean.  Clarifying Question: ": [" What is the purpose of the Diabetic Rockstar Festival?", " What is the purpose of the Diabetic Rockstar Festival?"], "Story:\nAngie went to the library with her mother. First she had to turn in the books she was returning at the return desk. They said hello to the man there. He took their books. Then they went into the adult reading room. Angie sat in a brown chair at the table. She made a drawing of her mother. Her mother found a large red book. Then they went to the Mystery section. Angie sat in a blue chair. She drew a picture of her brother. Her mother found the book. It was a green book. Finally it was time to go to the children's room. It was Story Hour. Miss Hudson was there to read to all the children. She read a book about friendship. After the story Angie sat in the red chair and began drawing. They were drawing pictures of friends. Angie drew a picture of her best friend Lilly. Miss Hudson hung the pictures on the wall. Then Angie and her mother picked out 8 books to read at home. They checked the books out and went home.\nHistory:\nwas she drawing?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What was Angie drawing in the adult reading room, the Mystery section, and the children's room?", " What was Angie drawing in the red chair after Miss Hudson read the story about friendship?"], "Story:\nAngie went to the library with her mother. First she had to turn in the books she was returning at the return desk. They said hello to the man there. He took their books. Then they went into the adult reading room. Angie sat in a brown chair at the table. She made a drawing of her mother. Her mother found a large red book. Then they went to the Mystery section. Angie sat in a blue chair. She drew a picture of her brother. Her mother found the book. It was a green book. Finally it was time to go to the children's room. It was Story Hour. Miss Hudson was there to read to all the children. She read a book about friendship. After the story Angie sat in the red chair and began drawing. They were drawing pictures of friends. Angie drew a picture of her best friend Lilly. Miss Hudson hung the pictures on the wall. Then Angie and her mother picked out 8 books to read at home. They checked the books out and went home.\nHistory:\nwho did she draw this time?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Who did Angie draw a picture of in the children's room during Story Hour?", " Who did Angie draw a picture of when she was in the children's room?"], "Story:\nResearches at Johns Hopkins University's. Applied Physics laboratory ( APL) in Laurel , Maryland have designed a new human-like robot, Its name is Robo Sally. The machine can be controlled from a distance and can he used to do work that is dangerous for human beings. \nHistory:\nRoho Sally has two long arms with human-like hands. She can use her fingers to pick up small objects .examine them in detail and do most things that human hands can do Each finger contains a tiny motor capable of squeezing 20 pounds of pinch foree ,.enough to defuse a bomb under the direction of an operator. She sits on a metal base with wheels that let her move around. turn in tight spaces and climb over small objects, . \nAmbiguous Question:\nMike McLoughlin is the main investigator for the Applied Physics Laboratory's Prosthetics Program. \"The purpose of that program is to develop prosthetic arms that have all the capability of your natural arms .and you do all the complex motions that we can do with the natural arm- with the robot. \"  Clarifying Question: ": [" What is the purpose of the Applied Physics Laboratory's Prosthetics Program?", " What is the purpose of the Prosthetics Program at APL?"], "Story:\nThe Recording Industry Association of America (RIAA) is a trade organization that represents the recording industry in the United States. Its members consist of record labels and distributors, which the RIAA says \"create, manufacture and/or distribute approximately 85% of all legally sold recorded music in the United States.\" The RIAA headquarters is in Washington, D.C. \nHistory:\nThe RIAA was formed in 1952. Its original mission was to administer recording copyright fees and problems, work with trade unions, and do research relating to the record industry and government regulations. Early RIAA standards included the RIAA equalization curve, the format of the stereophonic record groove and the dimensions of 33 1/3 rpm, 45 rpm, and 78 rpm records. \nAmbiguous Question:\nThe RIAA says its current mission includes:  Clarifying Question: ": [" What are the specific objectives of the RIAA's current mission?", " What are the specific tasks of the RIAA in its current mission?"], "Story:\nCHAPTER III. SWEDENBORG AND THE SIBYL. \nHistory:\nMY narrative may move on again from the point at which it paused in the first chapter. \nAmbiguous Question:\nMary and I (as you may remember) had left the bailiff alone at the decoy, and had set forth on our way together to Dermody's cottage.  Clarifying Question: ": [" What was the purpose of Mary and the narrator's journey to Dermody's cottage?", " What was the purpose of Mary and I's journey to Dermody's cottage?"], "Story:\nCAIRO, Egypt (CNN) -- Omar bin Laden has a message for his father, Osama: \"Find another way.\" \nHistory:\nOmar bin Laden says he last saw his father in 2000 when the son decided to leave al Qaeda. \nAmbiguous Question:\nThe son of the most-wanted man in the world spoke Sunday to CNN in a quiet, middle-class suburb about an hour outside Cairo, Egypt.  Clarifying Question: ": [" How long has it been since Omar bin Laden last saw his father?", " What was the purpose of Omar bin Laden's visit to Cairo, Egypt?"], "Story:\nSatire is a genre of literature, and sometimes graphic and performing arts, in which vices, follies, abuses, and shortcomings are held up to ridicule, ideally with the intent of shaming individuals, corporations, government, or society itself into improvement. Although satire is usually meant to be humorous, its greater purpose is often constructive social criticism, using wit to draw attention to both particular and wider issues in society. \nHistory:\nA feature of satire is strong irony or sarcasm—\"in satire, irony is militant\"—but parody, burlesque, exaggeration, juxtaposition, comparison, analogy, and double entendre are all frequently used in satirical speech and writing. This \"militant\" irony or sarcasm often professes to approve of (or at least accept as natural) the very things the satirist wishes to attack. \nAmbiguous Question:\nSatire is nowadays found in many artistic forms of expression, including internet memes, literature, plays, commentary, television shows, and media such as lyrics.  Clarifying Question: ": [" What is the primary purpose of satire?", " What are the common elements of satire found in different forms of expression?"], "Story:\nJane's doll, Samantha, was a magical doll. Jane kept Samantha hidden from her friends, even Julie, who was her best friend. Jane didn't want all the other girls from school, like Wanda and Ruth, to find out that she had a magical doll. Samantha could do things other dolls couldn't. Jane would whisper in her ear a secret word, and all of a sudden Samantha would come to life, hopping around, running all over. But Samantha did more than run, she could talk. Jane told Samantha everything, and Samantha understood. One day, Jane was naughty and lied to her mother. Jane's mother put Samantha on top of the refrigerator where Jane could not get to her. Jane was very sad. The one person she told everything to was out of her reach. The next day, Jane had one of the worst days of her life. She needed to tell someone, but Julie wasn't around. She needed Samantha. She had no ladder, chair, or stool to reach her. Julie moved the kitchen table forward towards the refrigerator, and hopped on top. She started to climb up to reach for Samantha, and grabbed her quickly. She came down, dropping Samantha on the floor, and broke Samantha. Jane whispered the secret word, but Samantha didn't awake. Samantha's powers were gone. She couldn't walk, run, talk, or listen. Jane hurt her the one person she could trust the most. Then, Samantha moved, looked at Jane, and a tear came from her eye. Samantha's eyes closed, and she was without life. She cried no more.\nHistory:\nhow?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" How did Jane manage to get Samantha off the top of the refrigerator?", " How did Jane reach Samantha on top of the refrigerator?"], "Story:\nCHAPTER XLII. \nHistory:\nGEORGE II. A.D. 1725--1760. \nAmbiguous Question:\nThe reign of George II. was a very warlike one. Indeed he was the last king of England who ever was personally in a battle; and, curiously enough, this battle--that of Fontenoy--was the last that a king of France also was present in. It was, however, not a very interesting battle; and it was not clear who really won it, nor are wars of this time very easy to understand.  Clarifying Question: ": [" What were the outcomes of the Battle of Fontenoy during the reign of George II?", " What were the outcomes of the Battle of Fontenoy during the reign of George II?"], "Story:\n(RollingStone.com) -- Jon Stewart says that his Rally to Restore Sanity -- and Stephen Colbert's sister event, March to Keep Fear Alive -- are not meant to counter Glenn Beck's Restoring Honor event of last August. \nHistory:\n\"The march is like everything that we do, just a construct ... to translate the type of material that Stephen and I do on \"The Daily Show\" and \"Colbert Report,\" Stewart said at a Q&A last night at New York's 92nd Street Y. \nAmbiguous Question:\nInstead, the rallies are meant to satirize the political process, and the news coverage spawned from it.  Clarifying Question: ": [" What is the purpose of the Rally to Restore Sanity and the March to Keep Fear Alive?", " What was the purpose of Glenn Beck's Restoring Honor event in August?"], "Story:\nBhutan, officially the Kingdom of Bhutan, is a landlocked country in South Asia. Located in the Eastern Himalayas, it is bordered by Tibet Autonomous Region in the north, India in the south, the Sikkim state of India and the Chumbi Valley of Tibet in the west, and Arunachal Pradesh state of India in the east. Bhutan is geopolitically in South Asia and is the region's second least populous nation after the Maldives. Thimphu is its capital and largest city, while Phuntsholing is its financial center. \nHistory:\nThe independence of Bhutan has endured for centuries, and the territory was never colonized in its history. Situated on the ancient Silk Road between Tibet, the Indian subcontinent and Southeast Asia, the Bhutanese state developed a distinct national identity based on Buddhism. Headed by a spiritual leader known as the Zhabdrung Rinpoche, the territory was composed of many fiefdoms and governed as a Buddhist theocracy. Following a civil war in the 19th century, the House of Wangchuck reunited the country and established relations with the British Empire. Bhutan fostered a strategic partnership with India during the rise of Chinese communism and has a disputed border with the People's Republic of China. In 2008, it transitioned from an absolute monarchy to a constitutional monarchy and held the first election to the National Assembly of Bhutan, that has a two party system characterizing Bhutanese democracy.\nAmbiguous Question:\nWhere does it rank in city size? Clarifying Question: ": ["\nWhat is the population size of Bhutan compared to other countries in the region?", "\nWhat is the population of Bhutan compared to other countries in South Asia?"], "Story:\nVancouver is a coastal seaport city in Canada, located in the Lower Mainland region of British Columbia. As the most populous city in the province, the 2016 census recorded 631,486 people in the city, up from 603,502 in 2011. The Greater Vancouver area had a population of 2,463,431 in 2016, making it the third-largest metropolitan area in Canada. Vancouver has the highest population density in Canada with over 5,400 people per square kilometre. With over 250,000 residents, Vancouver is the fourth-most densely populated city in North America behind New York City, San Francisco, and Mexico City according to the 2011 census. Vancouver is one of the most ethnically and linguistically diverse cities in Canada according to that census; 52% of its residents have a first language other than English. Vancouver is classed as a Beta global city. \nHistory:\nVancouver is consistently named as one of the top five worldwide cities for livability and quality of life, and the Economist Intelligence Unit acknowledged it as the first city ranked among the top-ten of the world's most well-living cities for five consecutive years. Vancouver has hosted many international conferences and events, including the 1954 British Empire and Commonwealth Games, UN Habitat I, Expo 86, the World Police and Fire Games in 1989 and 2009; and the 2010 Winter Olympics and Paralympics which were held in Vancouver and Whistler, a resort community north of the city. In 2014, following thirty years in California, the TED conference made Vancouver its indefinite home. Several matches of the 2015 FIFA Women's World Cup were played in Vancouver, including the final at BC Place.\nAmbiguous Question:\nAnd another? Clarifying Question: ": ["\nWhat other international conferences and events has Vancouver hosted?", " What other international conferences and events has Vancouver hosted?"], "Story:\nThe American Broadcasting Company (ABC) (stylized in its logo as abc since 1957) is an American commercial broadcast television network that is owned by the Disney–ABC Television Group, a subsidiary of Disney Media Networks division of The Walt Disney Company. The network is part of the Big Three television networks. The network is headquartered on Columbus Avenue and West 66th Street in Manhattan, with additional major offices and production facilities in New York City, Los Angeles and Burbank, California. \nHistory:\nABC originally launched on October 12, 1943 as a radio network, separated from and serving as the successor to the NBC Blue Network, which had been purchased by Edward J. Noble. It extended its operations to television in 1948, following in the footsteps of established broadcast networks CBS and NBC. In the mid-1950s, ABC merged with United Paramount Theatres, a chain of movie theaters that formerly operated as a subsidiary of Paramount Pictures. Leonard Goldenson, who had been the head of UPT, made the new television network profitable by helping develop and greenlight many successful series. In the 1980s, after purchasing an 80% interest in cable sports channel ESPN, the network's parent merged with Capital Cities Communications, owner of several print publications, and television and radio stations. In 1996, most of Capital Cities/ABC's assets were purchased by The Walt Disney Company.\nAmbiguous Question:\nFor how much? Clarifying Question: ": ["\nHow much did The Walt Disney Company purchase Capital Cities/ABC's assets for in 1996?", "\nHow much did The Walt Disney Company pay to purchase most of Capital Cities/ABC's assets in 1996?"], "Story:\nMinot, North Dakota (CNN) -- A spontaneous burst of applause broke out at a Saturday press conference in Minot, North Dakota, when the city's mayor said the Souris River should crest overnight -- about 12 feet higher than flood stage, but several inches short of what had been feared. \nHistory:\n\"This is great news,\" said Mayor Curt Zimbelman. \nAmbiguous Question:\nThis prediction from the National Weather Service proved a rare bright spot in what has been, and continues to be, a trying time for citizens in Minot and neighboring communities.  Clarifying Question: ": [" What was the National Weather Service's prediction regarding the Souris River cresting?", " What was the National Weather Service's prediction regarding the Souris River cresting in Minot, North Dakota?"], "Story:\nIt takes more than just practice to become an Olympian. Gold medal performances require some serious nutrition. Have you ever wondered what these successful athletes eat to stay in peak shape? \nHistory:\nKeri Glassman, a registered dietitian and founder of Nutritious Life Meals, appeared on \"Good Morning America\" today to give you a glimpse into the diets of some top athletes. Some of their meals could surprise you. \nAmbiguous Question:\nCrazy Calorie Count  Clarifying Question: ": ["\nWhat are some examples of the calorie counts of meals eaten by Olympic athletes?", " What are some of the meals that Olympic athletes eat to stay in peak shape?"], "Story:\nCHAPTER XXVI \nHistory:\nTHE SKATING RACE \nAmbiguous Question:\nFor nearly half a mile Peter Slade kept the lead with ease, but then his breath began to fail him. Looking over his shoulder, he saw both Larry and Dick crawling up.  Clarifying Question: ": [" Who were Larry and Dick and how did they catch up to Peter in the skating race?", " How far did Peter Slade have to skate in the race?"], "Story:\n(CNN) -- With Walter White dead, fans everywhere are mourning, celebrating, tallying up bets and discussing what just happened. Was the series finale of \"Breaking Bad\" satisfying? Did it tie up all loose ends? Did the character you wanted to live survive and did the ones you wanted to die get their just deserts? Is it sending you back to the beginning to binge watch it all over again? \nHistory:\nJust when it seemed Walt was heading out of his New Hampshire hideaway to exact revenge on Elliot and Gretchen Schwartz (for dismissing his involvement with Gray Matter Technologies in the episode previous), he pulled the first of several surprises of the evening. Instead of threatening to kill them outright, he asks them to set up a trust fund so that his children would benefit from the money he'd illegally amassed (presumably the goal of his entire meth enterprise to begin with). \nAmbiguous Question:\nGretchen and Elliott of course are terrified by his sudden appearance in their ritzy new home, but had they been paying attention, they would have seen Walt waltz on in. His entrance is a bit ironic, considering their wealth and legitimacy is in some way a result of his earlier contributions. He's always been there, in the shadows, whether they acknowledged him or not.  Clarifying Question: ": [" What was Walt's primary motivation for visiting Gretchen and Elliott?", " How did Walt's entrance into Gretchen and Elliott's home reflect his role in their lives?"], "Story:\nMarvel counts among its characters such well-known superheroes as Spider-Man, Iron Man, Captain America, Wolverine, Thor, Hulk, Ant-Man, such teams as the Avengers, the Guardians of the Galaxy, the Fantastic Four, the Inhumans and the X-Men, and antagonists such as Doctor Doom, The Enchantress, Green Goblin, Ultron, Doctor Octopus, Thanos, Magneto and Loki. Most of Marvel's fictional characters operate in a single reality known as the Marvel Universe, with locations that mirror real-life cities. Characters such as Spider-Man, the Fantastic Four, the Avengers, Daredevil and Doctor Strange are based in New York City, whereas the X-Men have historically been based in Salem Center, New York and Hulk's stories often have been set in the American Southwest. \nHistory:\nMartin Goodman founded the company later known as Marvel Comics under the name Timely Publications in 1939. Martin Goodman, a pulp magazine publisher who had started with a Western pulp in 1933, was expanding into the emerging—and by then already highly popular—new medium of comic books. Launching his new line from his existing company's offices at 330 West 42nd Street, New York City, he officially held the titles of editor, managing editor, and business manager, with Abraham Goodman officially listed as publisher.\nAmbiguous Question:\nis one named? Clarifying Question: ": ["\nWhich characters are named in the Marvel Universe?", "\nWhich of the Marvel characters are named in the story?"], "Story:\nAll the animals were having a picnic. Turtle brought hotdogs for everyone. All the animals came to make their hotdogs. Rabbit put ketchup on his hotdog. Duck put mustard on his hotdog. Bear put ketchup and mustard on his hotdog. Turtle and Fox did not put ketchup or mustard on their hotdog. Goose looked at the hotdogs. He did not like hotdogs at all. He was very hungry. He looked around for something else to eat. Duck had brought chips, but Goose did not like chips. Bear had brought salad, but Goose did not like salad. Fox had brought apples, but Goose did not like apples. Rabbit brought carrots, but Goose did not like carrots. Goose looked around for something that he liked. Then he saw something near the edge of the meadow. It was a bunch of red strawberries. Goose liked strawberries very much. He took a basket and gathered up as many strawberries as he could and brought them to the picnic. Everyone was happy, and Goose was not hungry any more.\nHistory:\nwho?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Who gathered the strawberries for the picnic?", " Who gathered the strawberries for the picnic?"], "Story:\nAll the animals were having a picnic. Turtle brought hotdogs for everyone. All the animals came to make their hotdogs. Rabbit put ketchup on his hotdog. Duck put mustard on his hotdog. Bear put ketchup and mustard on his hotdog. Turtle and Fox did not put ketchup or mustard on their hotdog. Goose looked at the hotdogs. He did not like hotdogs at all. He was very hungry. He looked around for something else to eat. Duck had brought chips, but Goose did not like chips. Bear had brought salad, but Goose did not like salad. Fox had brought apples, but Goose did not like apples. Rabbit brought carrots, but Goose did not like carrots. Goose looked around for something that he liked. Then he saw something near the edge of the meadow. It was a bunch of red strawberries. Goose liked strawberries very much. He took a basket and gathered up as many strawberries as he could and brought them to the picnic. Everyone was happy, and Goose was not hungry any more.\nHistory:\nwhat was the others reaction?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What was the reaction of the other animals when Goose brought the strawberries to the picnic?", " What was the reaction of the other animals when Goose brought the strawberries to the picnic?"], "Story:\nMarcel lived on a farm. Every morning when he woke up, he got dressed, washed his face, and then helped his Pa with the chores before having breakfast. After breakfast, he walked with his sisters to the school in the town. \nHistory:\nOne day on his way to school, Marcel remembered he left his books on the table. \"Oh no!\" he said. \"I forgot my books!\" \nAmbiguous Question:\nHis older sister Lucianne frowned. \"Oh, Marcel, how could you be so forgetful? You'll have to go home and get them.\"  Clarifying Question: ": [" What did Marcel have to do to get his books?", " What did Marcel have to do to get his books?"], "Story:\n(CNN) -- When Barack Obama was elected U.S. president he probably did not realize it would give him a chance to pick up tips on his backswing from the world's elite golfers. \nHistory:\nU.S. President Barack Obama and Vice President Joe Biden make use of the White House putting green. \nAmbiguous Question:\nObama is the honorary chairman for the 2009 Presidents Cup which will be contested at Harding Park Golf Course in San Francisco this week where the top U.S. golfers take on the best players from around the world outside of Europe.  Clarifying Question: ": [" What is the purpose of the 2009 Presidents Cup?", " What is the purpose of the 2009 Presidents Cup?"], "Story:\nOnce there was a boy named Fritz who loved to draw. He drew everything. In the morning, he drew a picture of his cereal with milk. His papa said, \"Don't draw your cereal. Eat it!\" After school, Fritz drew a picture of his bicycle. His uncle said, \"Don't draw your bicycle. Ride it!\" At nighttime, after he finished washing his face, he drew a picture of the toothpaste on the sink. His mama said, \"Don't draw the toothpaste. Brush your teeth!\" \nHistory:\nOne day Fritz got a splinter in his foot. It hurt. He wanted to take the splinter out. But first, he drew a picture of his foot with the splinter in it. He said, \"Now I can remember what my foot looks like with a splinter in it.\" Then he took the splinter out all by himself. He told his friend Stephen that he took the splinter out all by himself. Stephen did not believe him. Fritz showed him the picture. Then Stephen believed him.\nAmbiguous Question:\nWhat? Clarifying Question: ": ["\nWhat did Fritz do to prove to Stephen that he had taken the splinter out of his foot by himself?", "\nWhat did Fritz do to prove to his friend Stephen that he took the splinter out of his foot all by himself?"], "Story:\nChen Jie, 14, from Ningbo, Zhejiang is a lucky girl. She got 3600 yuan as gift money this Spring Festival. However, her grandmother took away all the money and put it in a bank account. Many students experienced the same thing as Chen. They got their gift money, only to immediately have it taken away. Xiong Shengyue, 14, from Nanjing, doesn't agree with the practice. \"I think the money should be the children's, \" she said. \" We should take care of it by ourselves.\" It is not that simple, said Chu Chaohui, a researcher at national Institute of Education Sciences. Giving gift money is used to show social status and develop relationships, he told Beijing Legal Evening News. Gift money has lost its traditional meaning of good will and has \"little to do with the children\". What's more, children don't earn the money through work. So he thought that parents should still play a big part in dealing with the money. But Yan Honglan, a mother of a 14-year-old boy in Beijing, has let her son be responsible for his gift money since the age of 8. \"I want to develop his financial skills, ' Yan said. She also added:\"No matter how you deal with the money, the most important thing is to make the children feel they're respected and trusted. Chen supported Yan's idea. She said that though she knew her grandmother wouldn't waste her gift money, she would feel happier if she could at least know how the money is spent. \"It would make me feel a little bit more grown-up,\" she said.\nHistory:\nHow old are they?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What is the age of the children mentioned in the story?", " What is the age of the children in the story?"], "Story:\nThe term Muslim world, also known as Islamic world and the Ummah (Arabic: أمة‎, meaning \"nation\" or \"community\") has different meanings. In a religious sense, the Islamic Ummah refers to those who adhere to the teachings of Islam, referred to as Muslims. In a cultural sense, the Muslim Ummah refers to Islamic civilization, exclusive of non-Muslims living in that civilization. In a modern geopolitical sense, the term \"Islamic Nation\" usually refers collectively to Muslim-majority countries, states, districts, or towns. \nHistory:\nThe Islamic Golden Age coincided with the Middle Ages in the Muslim world, starting with the rise of Islam and establishment of the first Islamic state in 622. The end of the age is variously given as 1258 with the Mongolian Sack of Baghdad, or 1492 with the completion of the Christian Reconquista of the Emirate of Granada in Al-Andalus, Iberian Peninsula. During the reign of the Abbasid caliph Harun ar-Rashid (786 to 809), the legendary House of Wisdom was inaugurated in Baghdad where scholars from various parts of the world sought to translate and gather all the known world's knowledge into Arabic. The Abbasids were influenced by the Quranic injunctions and hadiths, such as \"the ink of a scholar is more holy than the blood of a martyr,\" that stressed the value of knowledge. The major Islamic capital cities of Baghdad, Cairo, and Córdoba became the main intellectual centers for science, philosophy, medicine, and education. During this period, the Muslim world was a collection of cultures; they drew together and advanced the knowledge gained from the ancient Greek, Roman, Persian, Chinese, Indian, Egyptian, and Phoenician civilizations.\nAmbiguous Question:\nwith what? Clarifying Question: ": ["\nWith what event is the end of the Islamic Golden Age associated?", " With what event did the Islamic Golden Age begin?"], "Story:\nMy Left Foot (1989) Imagine being a prisoner of your own body, unable to make any movements except to move your left foot. The main character in My Left Foot, based on the real story of cerebral palsy sufferer Christy Brown, can barely move his mouth to speak, but by controlling his left foot, he's able to express himself as an artist and poet. For his moving performance of Brown, Daniel Lewis won his first Academy Award for best actor. Shine (1996) Do you have a talent you're afraid to share with the world? David Helfgott seemed meant from childhood to be \"one of the truly great pianists,\" but the pressures of performing (and pleasing his father) resulted in a complete breakdown. Ten years in a mental institution didn't weaken Helfgott's musical gift: When he was rediscovered, he was playing concertos in a bar. Shine received s even Oscar nominations , and Geoffrey Rush won best actor for his performance of Helfgott. Life Is Beautiful (1997) Nothing's more powerful than the love between a parent and a child. In this heartbreaking Italian film, a father (Roberto Benigni) makes an unbelievable sacrifice for his 4-year-old son: trapped in a Nazi concentration camp in 1945, the Jewish man convinces his boy that they are playing a complicated game. He manages to spare him the horror of the terrible war, and even in his final moments of life, keeps his son smiling and hopeful. Benigni won the best actor Oscar. Stand and Deliver (1988) Few people can inspire us more than a good teacher. Jaime Escalante (Edward James Olmos got Oscar nomination for best actor) is a great one. Employed at a high school where kids are expected to fail, Escalante challenges his math students to struggle for better things, like getting good grades in the AP exam. Despite the obstacles in their lives, the classmates accomplish their goals, thanks to Mr. Escalante's support. The real Jaime Escalante, the Best Teacher in America, says that Stand and Deliver is \" 90% truth, 10% drama.\"\nHistory:\nWas there a movie made of it?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What is the history of the movie My Left Foot (1989), Shine (1996), Life Is Beautiful (1997) and Stand and Deliver (1988)?", " What is the story of the movie?"], "Story:\nOne sunny morning, Stewart chose to go to the beach. He knew that a rainstorm was going to arrive on Saturday and wanted to enjoy some sun before it arrived. \nHistory:\nStewart laid on his belly and began reading his newspaper. As he was enjoying the sun and the newspaper, he saw a bug crawl across his blanket. At first Stewart thought it was an ant, but the bug was moving too slowly to be an ant. As Stewart leaned in for a closer look, the bug cried out, \"Excuse me, sir! Can you help me?\" Stewart was surprised and jumped to his feet. \"You can talk!\" he shouted. \"Yes,\" said the bug. \"Please help me! As you might know, there is a rainstorm coming into town. Unfortunately, I do not have a place to call home. I need to find somewhere to sleep before the rain washes me away!\" Stewart felt sad. \"Gee,\" he cried. \"That sounds terrible!\" \nAmbiguous Question:\nStewart thought about the problem. \"Perhaps you can stay at my house,\" he said. The bug jumped for joy and said, \"Oh, that would be wonderful!\" The two traveled back to Stewart's house and the bug found a soft spot to sleep.  Clarifying Question: ": ["\nWhat type of bug was Stewart surprised to find crawling across his blanket?", "\nWhat type of bug was the one that Stewart encountered at the beach?"], "Story:\nOn a nice and sunny day, Bob and Sally walked to the beach. When they got there, the first thing they wanted to do was to look for buried treasure. To find the treasure they had brought two shovels and two buckets. They both started digging holes in the sand with their shovels. After looking very hard for treasure for an hour, they didn't find anything. This made Bob and Sally very sad. They gave up and went to play in the water. While they were playing in the water, Sally found a bottle with a little paper inside. Sally opened the bottle and found a treasure map. Sally showed the map to Bob and they started to look for the treasure. After walking every step that the map said, they started digging with their shovels. After digging a really a big hole, they found a box. They were very happy that they found it and wanted to see what was inside. Bob slowly opened the box and there was a very big pearl. Next, they ran to a special store to ask about the pearl. The worker in the store told Bob and Sally that the pearl could make them rich. Bob and Sally looked at each other and decided not to sell it. They took the pearl home and saved it in a special box, so they could remember their day at the beach.\nHistory:\nhow did they know to?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" How did Bob and Sally know to look for buried treasure at the beach?", " How did Bob and Sally know to look for buried treasure at the beach?"], "Story:\n(CNN) -- Andres Iniesta could miss Spain's opening game at the World Cup after suffering a thigh injury in a warm-up match. \nHistory:\nThe Barcelona midfielder set up two goals for Spain in their emphatic 6-0 win over Poland in Murcia on Monday, but was substituted after just 39 minutes. \nAmbiguous Question:\nIniesta missed a large chunk of Barcelona's season with a thigh complaint, but team doctors insisted the injury was only minor.  Clarifying Question: ": [" What was the severity of Iniesta's thigh injury in the warm-up match?", " How severe was the thigh injury that Iniesta suffered in the warm-up match?"], "Story:\n(CNN) -- Here's something shocking. \nHistory:\nDemocrats and Republicans totally disagree about the significance of the GOP's victory in the first major competitive congressional ballot box test of 2014. \nAmbiguous Question:\nRepublican candidate David Jolly narrowly edged out Democrat Alex Sink to win Tuesday's special election in Florida's 13th Congressional District. Jolly will fill out the term of his former boss, longtime Republican Rep. Bill Young, who died in October.  Clarifying Question: ": [" What were the implications of the Republican Party's victory in the special election in Florida's 13th Congressional District?", " What was the outcome of the special election in Florida's 13th Congressional District?"], "Story:\n(CNN) -- Barcelona moved five points clear in Spain as manager Pep Guardiola celebrated his 100th match in charge with a 4-0 victory at home to Racing Santander on Saturday. \nHistory:\nThe injury-hit defending champions brushed off the pre-match loss of star striker Zlatan Ibrahimovic to romp into a 3-0 halftime lead as they put pressure on Real Madrid to win Sunday's home match against Villarreal. \nAmbiguous Question:\nThe Swede is in doubt for Tuesday's Champions League trip to German club Stuttgart due to a swollen ankle.  Clarifying Question: ": [" What is the status of Zlatan Ibrahimovic's ankle injury?", " What is the status of Zlatan Ibrahimovic's ankle injury?"], "Story:\nCHAPTER X. The Cavaliere \nHistory:\nThere befell at last a couple of days during which Rowland was unable to go to the hotel. Late in the evening of the second one Roderick came into his room. In a few moments he announced that he had finished the bust of his mother. \nAmbiguous Question:\n\"And it 's magnificent!\" he declared. \"It 's one of the best things I have done.\"  Clarifying Question: ": [" What is the result of Roderick's work on the bust of his mother?", " How does Roderick feel about the completed bust of his mother?"], "Story:\nCHAPTER XV. \nHistory:\n\"DROP IT.\" \nAmbiguous Question:\nFor ten or twelve days after the little dinner in Berkeley Square Guss Mildmay bore her misfortunes without further spoken complaint. During all that time, though they were both in London, she never saw Jack De Baron, and she knew that in not seeing her he was neglecting her. But for so long she bore it. It is generally supposed that young ladies have to bear such sorrow without loud complaint; but Guss was more thoroughly emancipated than are some young ladies, and when moved was wont to speak her mind. At last, when she herself was only on foot with her father, she saw Jack De Baron riding with Lady George. It is quite true that she also saw, riding behind them, her perfidious friend, Mrs. Houghton, and a gentleman whom at that time she did not know to be Lady George's father. This was early in March, when equestrians in the park are not numerous. Guss stood for a moment looking at them, and Jack De Baron took off his hat. But Jack did not stop, and went on talking with that pleasant vivacity which she, poor girl, knew so well and valued so highly. Lady George liked it too, though she could hardly have given any reason for liking it, for, to tell the truth, there was not often much pith in Jack's conversation.  Clarifying Question: ": [" What was the reaction of Guss Mildmay when she saw Jack De Baron riding with Lady George?", " What was the reaction of Guss Mildmay when she saw Jack De Baron riding with Lady George in the park?"], "Story:\n(CNN) -- A second former co-owner of the California slaughterhouse involved in a recall of nearly nine million pounds of meat was charged with knowingly processing and distributing meat from cancerous cows, court documents released this week say. \nHistory:\nRobert Singleton, co-owner of the Rancho Feeding Corporation in Petaluma, was primarily responsible for purchasing cattle and loading shipments for distribution, prosecutors say. \nAmbiguous Question:\nHe is charged with distributing \"adulterated, misbranded, and uninspected\" meat, according to the documents.  Clarifying Question: ": [" What type of meat did Robert Singleton distribute?", " What type of meat was Robert Singleton charged with distributing?"], "Story:\nCHAPTER XVI \nHistory:\nMr. William Hayter, in the solitude of his chambers at the Milan Court, was a very altered personage. He extended no welcoming salutation to his midnight visitor but simply motioned him to a chair. \nAmbiguous Question:\n\"Well,\" he began, \"is your task finished that you are in London?\"  Clarifying Question: ": [" What task were you supposed to complete in London?", " What task did Mr. William Hayter assign to his midnight visitor?"], "Story:\nPenelope kissed her hamster named Cracker. She waved goodbye to her brother, Jacob. Penelope ran out the door. Penelope's neighbor, Mrs. Flower, said she would make banana pancakes for Penelope for breakfast. Penelope could also play with Mrs. Flower's new puppy, Cookie. Penelope saw a bowl with green beans, beets, and carrots from the store on the kitchen table. Yuck, thought Penelope. Penelope liked the new puppy. Cookie had a funny smile. Mrs. Flower gave Penelope a box of toys and told her to take Cookie to the backyard. Penelope was busy looking at the green tomatoes. She turned around and saw Cookie and Mr. Flower's cat, Thomas. Thomas and Cookie were playing with the toys. Thomas kicked a ball to Cookie and Cookie kicked the ball back. Cookie got a toy fish out the box. Thomas and Cookie played catch with the toy fish. Penelope was laughing because she never saw a dog and cat play together. Mrs. Flower came to the backyard. She asked Penelope if she wanted yogurt, apple sauce or chocolate pudding with her breakfast. Penelope said she wanted yogurt. Penelope went inside and ate her breakfast with Mrs. Flower and Mr. Flower.\nHistory:\nHow many kinds of vegetables were out?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" How many types of vegetables were in the bowl on the kitchen table?", " How many vegetables were on the kitchen table from the store?"], "Story:\nCHAPTER XXXIX \nHistory:\nDoctor Crofts Is Turned Out \nAmbiguous Question:\n\"Have you heard the news, my dear, from the Small House?\" said Mrs Boyce to her husband, some two or three days after Mrs Dale's visit to the squire. It was one o'clock, and the parish pastor had come in from his ministrations to dine with his wife and children.  Clarifying Question: ": [" What was the news Mrs Boyce was referring to regarding Mrs Dale's visit to the squire?", " What news was Mrs Boyce referring to when she asked her husband if he had heard from the Small House?"], "Story:\nAt the farm, the farmer found that he needed to go to the town to get some tools. He needed to pick up five things at the store. The farmer needed to get a shovel, some hay, extra string, feed for the horses and a tire for his truck. He also found that one of the steps on his ladder was broken and needed to be fixed. He would have to get some wood to fix the ladder. He thought he might like to look at new ladders and see if it was time to get a new one. He went into the house and found his keys. He started driving down the road when he found that he forgot his wallet and needed to go back to the house. He turned the truck around and went back to the house. While he was in the house, he remembered that he also needed to get some milk at the store. He picked up his keys and wallet and went back to his truck. He picked up all the items he needed in town and was still home in time for dinner.\nHistory:\nfor what?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What items did the farmer need to pick up in town?", " What items did the farmer need to pick up in town?"], "Story:\nAt the farm, the farmer found that he needed to go to the town to get some tools. He needed to pick up five things at the store. The farmer needed to get a shovel, some hay, extra string, feed for the horses and a tire for his truck. He also found that one of the steps on his ladder was broken and needed to be fixed. He would have to get some wood to fix the ladder. He thought he might like to look at new ladders and see if it was time to get a new one. He went into the house and found his keys. He started driving down the road when he found that he forgot his wallet and needed to go back to the house. He turned the truck around and went back to the house. While he was in the house, he remembered that he also needed to get some milk at the store. He picked up his keys and wallet and went back to his truck. He picked up all the items he needed in town and was still home in time for dinner.\nHistory:\nAnything else?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What did the farmer need to pick up at the store?", " What did the farmer need to get at the store in town?"], "Story:\nCHAPTER IX--THE WASP \nHistory:\n\nAmbiguous Question:\n'Whom He hath blessed and called His own, He tries them early, look and tone, Bent brow and throbbing heart, Tries them with pain.'  Clarifying Question: ": [" What is the purpose of the trials mentioned in this verse?", " What is being tested in the phrase \"He tries them early, look and tone, Bent brow and throbbing heart\"?"], "Story:\nI spent last weekend with my grandma and grandpa. I love them very much! I always look forward to visiting them! They always do fun things with me. Last weekend, we went to the zoo together. I saw a great big elephant. It had a long nose. My grandpa and I played a game to see who could be the most like an elephant. We stomped around a lot and made trumpeting noises. I won! Grandma looked on and laughed. I saw a monkeys too! The monkeys swung through the trees. They even made monkey noises! Grandma wanted to take a picture of me with the monkeys, but I was too busy pretending I was monkey to stand still. After we left the zoo, I went home. We had dinner together. Then, my grandma read me a story and tucked me into bed. I had a great time with my grandparents. I love them a lot. I always look forward to visiting them.\nHistory:\nand did he?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Did Grandpa win the game to be the most like an elephant?", " Did Grandpa win the game to be the most like an elephant?"], "Story:\nSolar time is a calculation of the passage of time based on the position of the Sun in the sky. The fundamental unit of solar time is the day. Two types of solar time are apparent solar time (sundial time) and mean solar time (clock time). \nHistory:\nA tall pole vertically fixed in the ground casts a shadow on any sunny day. At one moment during the day, the shadow will point exactly north or south (or disappear when and if the Sun moves directly overhead). That instant is local apparent noon, or 12:00 local apparent time. About 24 hours later the shadow will again point north/south, the Sun seeming to have covered a 360-degree arc around the Earth's axis. When the Sun has covered exactly 15 degrees (1/24 of a circle, both angles being measured in a plane perpendicular to the Earth's axis), local apparent time is 13:00 exactly; after 15 more degrees it will be 14:00 exactly. \nAmbiguous Question:\nThe problem is that in September the Sun takes less time (as measured by an accurate clock) to make an apparent revolution than it does in December; 24 \"hours\" of solar time can be 21 seconds less or 29 seconds more than 24 hours of clock time. As explained in the equation of time article, this is due to the eccentricity of the Earth's orbit (i.e. the Earth's orbit is not perfectly circular, meaning that the Earth-Sun distance varies throughout the year), and the fact that the Earth's axis is not perpendicular to the plane of its orbit (the so-called obliquity of the ecliptic). Clarifying Question: ": ["\nWhat is the difference between apparent solar time and mean solar time?", "\nWhat causes the discrepancy between solar time and clock time?"], "Story:\nOf all the speeches at the Democratic convention in Charlotte, North Carolina, few offended conservative listeners more than the speech by Sandra Fluke. \nHistory:\nThere are plenty of good reasons to be annoyed. From the conservative point of view, Fluke is on the wrong side of a battle over religious freedom. Back in March, she testified in favor of a proposed Obama administration rule that would require Catholic institutions, like her own Georgetown University law school, to reject the teaching of their church and cover contraception in their university health plans -- plans not funded by taxpayers, by the way, but by tuition and other university revenues. \nAmbiguous Question:\nNow here Fluke was again, on the national stage, warning that a vote for the Republican ticket in 2012 was a vote for \"an America in which you have a new vice president who co-sponsored a bill that would allow pregnant women to die preventable deaths in our emergency rooms. An America in which states humiliate women by forcing us to endure invasive ultrasounds we don't want and our doctors say we don't need.  Clarifying Question: ": [" What did Sandra Fluke specifically advocate for in her speech at the Democratic convention in Charlotte, North Carolina?", " What was the proposed Obama administration rule that Sandra Fluke testified in favor of?"], "Story:\nJohn was stuck in the middle of the ocean after his boat crashed and sank. He was worried about his friend who'd been in the boat with him. He knew that his friend has his life jacket on, so he tried not to worry too much about him. John was in a small box that fell out of the boat and kept him out of the water, floating. John had never been to sea before and one would wonder if he would ever after such a scary thing that happened to him. He sat in the box for days with no food or water, in and out of sleep. Three days later he woke up and saw land. Finally a beach was in sight, John could go home.\nHistory:\nWhat did his friend have?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What did John's friend have on when the boat crashed?", " What did John's friend have on when they were in the boat?"], "Story:\nEurope is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. Europe is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia. Europe is generally considered as separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas, and the waterways of the Turkish Straits. Yet the non-oceanic borders of Europe—a concept dating back to classical antiquity—are arbitrary and amount to a historical and social construct. The primarily physiographic term \"continent\" as applied to Europe also incorporates cultural and political elements whose discontinuities are not always reflected by the continent's current overland boundary with Asia. \nHistory:\nEurope covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a total population of about /1e6 round 0 million (about 11% of world population) . The European climate is largely affected by warm Atlantic currents that temper winters and summers on much of the continent, even at latitudes along which the climate in Asia and North America is severe. Further from the sea, seasonal differences are more noticeable than close to the coast.\nAmbiguous Question:\nis there a sea near it? Clarifying Question: ": ["\nWhat are the bodies of water that border Europe?", "\nWhat bodies of water border Europe?"], "Story:\n(CNN) -- Swedish golfer Henrik Stenson carded a solid 69 in the opening round of the WGC-CA Championship but it was his highly unusual recovery shot on the 12th on the Blue Monster course at Doral which raised more than a few eyebrows. \nHistory:\nStenson did not leave much to the imagination with his Doral antics. \nAmbiguous Question:\nStenson stripped down to the bare essentials -- a pair of white boxer shorts -- before wading into the mud to hack out his ball after an wayward tee shot.  Clarifying Question: ": [" What did Henrik Stenson do with his clothing before attempting his recovery shot on the 12th hole?", " What did Henrik Stenson do to retrieve his ball after an errant tee shot on the 12th hole of the Blue Monster course at Doral?"], "Story:\n(CNN) -- Tiger Woods faces two challengers as he bids to retain the world's No. 1 golf ranking for a 271st week at the WGC-Bridgestone Invitational starting in Ohio on Thursday. \nHistory:\nThe 34-year-old has been at the summit for an unprecedented 612 weeks in total, but once again faces the prospect of losing top spot to fellow American Phil Mickelson -- and a new contender, world No. 3 Lee Westwood. \nAmbiguous Question:\nWhile second-ranked Mickelson has failed to take advantage of Woods' struggles in recent weeks, finishing only tied for 48th at the British Open, Westwood has racked up the points after placing second at his home major last month.  Clarifying Question: ": [" What is the current world ranking of Phil Mickelson?", " What is the ranking of Lee Westwood?"], "Story:\nWhen it comes to relationship, we spend a lot of time discussing their joys, but rarely talk about the pain when they break down. Yet most people have a story about a broken relationship. \nHistory:\nFor Jane Black, a six-year friendship ended when her friend was rude to one of her children. \"After quite a few drinks at a party in my house, she said something rude to my child. I ended the friendship face to face at the party,\" she says. \"I didn't realize what I was doing at the time, I was simply standing up for my child, but in her eyes any challenge was a betrayal.\" \nAmbiguous Question:\nWhen Angela Thompson noticed a seven-year friendship disappearing, she let it go. \"I didn't know how to deal with the issue. I didn't sit down for a grown-up conversation; I just walked away quietly.\" The decision caused a reaction among Thompson's other friends. \"The other friends in the circle are the worst people when you are trying to break up with a friend,\" she says. \"They don't want you to stop being friends, because it puts them in a difficult position. You get told to just get it over.\"  Clarifying Question: ": ["\nWhat caused Angela Thompson to decide to end her seven-year friendship?", "\nWhat was the reason for Angela Thompson's decision to end her seven-year friendship?"], "Story:\nEdward Sims was born in 1892. He was the fifth child and only son of Herbert and Dora Sims. Herbert was a blacksmith , and had a thriving trade making horseshoes. He was determined that his first-born son would follow him into the blacksmith. For this reason, Edward had to leave school at the age of 12,and worked with his father. \nHistory:\nHowever, Edward was _ a blacksmith. Although he has an athletic body, he didn't have strong arms like his father, and he felt dizzy in the heat of the smithy. When he tried to find alternative employment, he found it difficult because he had never learnt to read or write. \nAmbiguous Question:\nOne day, he went for an interview at a solictior's office. The job was a runner, taking documents from the office to other offices in the city. The solicitor was pleased to see that Edward was physically fit, but when he discovered that the young man couldn't read or write, he decided against employing him. \"How can you deliver documents to other offices,\" he asked, \"if you can't read the addresses on them?\"  Clarifying Question: ": [" What was Edward's occupation before becoming a runner?", " What was Edward's occupation prior to the interview at the solicitor's office?"], "Story:\nCHAPTER XVI \nHistory:\nON A BUSINESS BASIS \nAmbiguous Question:\nCaptain Horn found Edna at the entrance to the caves, busily employed in filling one of the Rackbirds' boxes with ship-biscuit.  Clarifying Question: ": [" What was Edna doing at the entrance to the caves?", " What was Edna doing when Captain Horn found her at the entrance to the caves?"], "Story:\nIn economics, a free market is a system in which the prices for goods and services are determined by the open market and consumers, in which the laws and forces of supply and demand are free from any intervention by a government, price-setting monopoly, or other authority. \nHistory:\nThe concept of free market contrasts with regulated market, in which a government intervenes in supply and demand through various methods such as tariffs used to restrict trade and protect the economy. In a free market economy, prices for goods and services are set freely by the forces of supply and demand and are allowed to reach their point of equilibrium without intervention by government policy. \nAmbiguous Question:\nAlthough free markets are commonly associated with capitalism within a market economy in contemporary usage and popular culture, free markets have also been advocated by free-market anarchists, market socialists, and some proponents of cooperatives and advocates of profit sharing. Criticism of the theoretical concept consider systems with significant market power, inequality of bargaining power, or information asymmetry to be less than free, with regulation being necessary to control those imbalances.  Clarifying Question: ": ["\nWhat are the differences between a free market and a regulated market?", " What are the various implications of free markets, and what are the benefits and drawbacks of a free market system?"], "Story:\nBBC News Online is the website of BBC News, the division of the BBC responsible for newsgathering and production. The website is the most frequently accessed news website in the United Kingdom, and forms a major part of BBC Online (bbc.co.uk), which records around 70 million unique users a week (around 60 to 70% of visitors are from the UK). \nHistory:\nThe website contains international news coverage, as well as British, entertainment, science, and political news. Many reports are accompanied by audio and video from the BBC's television and radio news services, while the latest TV and radio bulletins are also available to view or listen to on the site together with other current affairs programmes. \nAmbiguous Question:\nBBC News Online is closely linked to its sister department website, that of BBC Sport. Both sites follow similar layout and content options and respective journalists work alongside each other. Location information provided by users is also shared with the website of BBC Weather to provide local content.  Clarifying Question: ": [" What type of information does BBC Weather provide?", " What is the relationship between BBC News Online and BBC Online?"], "Story:\nWe live in an amazing world, reading the following news and you will find it yourself. News 1: Bao Xishun is the tallest man in the world. He is 2.36 metres tall. He Pingping is the shortest man in the world. He is only 0.73 metres tall. They are Chinese. On July 13th, Bao Xishun married a girl and He Pingping took part in their wedding ceremony . News 2: In the USA, a seventh-grader, Aidan Murray Medley went fishing in the sea one morning. The 12-year-old boy caught a 250-kilogram shark! It took Aidan 28 minutes to catch the shark. It was so hard that his body lost all feeling. Aidan now has the Florida record . He beat a 232-kilogram catch from 1981. News 3: A young sheep climbs a tree to feed on leaves in a park in the southern Swedish town of Lund. The sheep climbed to a height of seven metres and spent an hour and a half in the tree before returning to the ground.\nHistory:\nDid that hurt him?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Did Aidan Murray Medley feel any pain when he caught the 250-kilogram shark?", " Did the shark hurt Aidan when he caught it?"], "Story:\nRussian (ру́сский язы́к, russkiy yazyk, pronounced [ˈruskʲɪj jɪˈzɨk] ( listen)) is an East Slavic language and an official language in Russia, Belarus, Kazakhstan, Kyrgyzstan and many minor or unrecognised territories. It is an unofficial but widely-spoken language in Ukraine, Latvia, Estonia, and to a lesser extent, the other countries that were once constituent republics of the Soviet Union and former participants of the Eastern Bloc. Russian belongs to the family of Indo-European languages and is one of the three living members of the East Slavic languages. Written examples of Old East Slavonic are attested from the 10th century onwards. \nHistory:\nRussian distinguishes between consonant phonemes with palatal secondary articulation and those without, the so-called soft and hard sounds. This distinction is found between pairs of almost all consonants and is one of the most distinguishing features of the language. Another important aspect is the reduction of unstressed vowels. Stress, which is unpredictable, is not normally indicated orthographically though an optional acute accent (знак ударения, znak udareniya) may be used to mark stress, such as to distinguish between homographic words, for example замо́к (zamok, meaning a lock) and за́мок (zamok, meaning a castle), or to indicate the proper pronunciation of uncommon words or names.\nAmbiguous Question:\nare there other countries that also use it? Clarifying Question: ": ["\nWhat other countries are known to use Russian as an official or unofficial language?", "\nWhat other countries use Russian as an official or unofficial language?"], "Story:\nJohn was very hungry. So he chose to make a sandwich. John invited Susan, Tim, and Jack over to help him. They all pulled out bread, lettuce, tomato, meat, pickle, and cheese. Cheese is Johns favorite food. One at a time, they each put one ingredient on the sandwich. John put the bread down. Tim put the tomato down. Susan put the meat down. Jack put the lettuce down. John also put the cheese down. Susan put the pickle down. After they finished, John ate his sandwich and it was delicious.\nHistory:\nDid she also put down another topping?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": ["\nWhich topping did Susan put down after the pickle?", " What topping did Susan put on the sandwich?"], "Story:\n(CNN) -- The 5-year-old son of country music singer Mindy McCready has been recovered and is in good health in the custody of officials in Arkansas, a spokeswoman for the Florida Department of Children and Families told CNN Friday. \nHistory:\n\"We're working with local law enforcement and the Arkansas (Division of Children and Family Services) and we're going to bring him home to Florida to his legal guardian as soon as possible,\" Terri Durdaller said about the boy, Zander. \nAmbiguous Question:\nMindy McCready's assistant said the singer turned Zander over to the Arkansas authorities and that he would be returned to her on Monday. \"She's looking forward to having her case heard in front of an unbiased courtroom,\" the assistant said. \"She has a 99% chance of her child leaving with her on Monday morning.\"  Clarifying Question: ": [" What is the legal basis for Mindy McCready's claim to custody of Zander?", " What legal proceedings is Mindy McCready undertaking in order to ensure that she will be able to take her son, Zander, home on Monday?"], "Story:\nCHAPTER III--SOAMES PREPARES TO TAKE STEPS \nHistory:\nWhen Soames entered his sister's little Louis Quinze drawing-room, with its small balcony, always flowered with hanging geraniums in the summer, and now with pots of Lilium Auratum, he was struck by the immutability of human affairs. It looked just the same as on his first visit to the newly married Darties twenty-one years ago. He had chosen the furniture himself, and so completely that no subsequent purchase had ever been able to change the room's atmosphere. Yes, he had founded his sister well, and she had wanted it. Indeed, it said a great deal for Winifred that after all this time with Dartie she remained well-founded. From the first Soames had nosed out Dartie's nature from underneath the plausibility, savoir faire, and good looks which had dazzled Winifred, her mother, and even James, to the extent of permitting the fellow to marry his daughter without bringing anything but shares of no value into settlement. \nAmbiguous Question:\nWinifred, whom he noticed next to the furniture, was sitting at her Buhl bureau with a letter in her hand. She rose and came towards him. Tall as himself, strong in the cheekbones, well tailored, something in her face disturbed Soames. She crumpled the letter in her hand, but seemed to change her mind and held it out to him. He was her lawyer as well as her brother.  Clarifying Question: ": [" What was the nature of the letter that Winifred held out to Soames?", " What did Soames think of the letter Winifred held out to him?"], "Story:\nAn antenna (plural antennae or antennas), or aerial, is an electrical device which converts electric power into radio waves, and vice versa. It is usually used with a radio transmitter or radio receiver. In transmission, a radio transmitter supplies an electric current oscillating at radio frequency (i.e. a high frequency alternating current (AC)) to the antenna's terminals, and the antenna radiates the energy from the current as electromagnetic waves (radio waves). In reception, an antenna intercepts some of the power of an electromagnetic wave in order to produce a tiny voltage at its terminals, that is applied to a receiver to be amplified. \nHistory:\nTypically an antenna consists of an arrangement of metallic conductors (elements), electrically connected (often through a transmission line) to the receiver or transmitter. An oscillating current of electrons forced through the antenna by a transmitter will create an oscillating magnetic field around the antenna elements, while the charge of the electrons also creates an oscillating electric field along the elements. These time-varying fields radiate away from the antenna into space as a moving transverse electromagnetic field wave. Conversely, during reception, the oscillating electric and magnetic fields of an incoming radio wave exert force on the electrons in the antenna elements, causing them to move back and forth, creating oscillating currents in the antenna.\nAmbiguous Question:\nDoes it have another name? Clarifying Question: ": ["\nWhat is the purpose of an antenna?", "\nWhat is the other name for an antenna?"], "Story:\nWorld War I (WWI or WW1), also known as the First World War, the Great War, or the War to End All Wars, was a global war originating in Europe that lasted from 28 July 1914 to 11 November 1918. More than 70 million military personnel, including 60 million Europeans, were mobilised in one of the largest wars in history. Over nine million combatants and seven million civilians died as a result of the war (including the victims of a number of genocides), a casualty rate exacerbated by the belligerents' technological and industrial sophistication, and the tactical stalemate caused by gruelling trench warfare. It was one of the deadliest conflicts in history, and paved the way for major political changes, including revolutions in many of the nations involved. Unresolved rivalries still extant at the end of the conflict contributed to the start of the Second World War only twenty-one years later. \nHistory:\nThe war drew in all the world's economic great powers, assembled in two opposing alliances: the Allies (based on the Triple Entente of the Russian Empire, the French Third Republic, and the United Kingdom of Great Britain and Ireland) versus the Central Powers of Germany and Austria-Hungary. Although Italy was a member of the Triple Alliance alongside Germany and Austria-Hungary, it did not join the Central Powers, as Austria-Hungary had taken the offensive against the terms of the alliance. These alliances were reorganised and expanded as more nations entered the war: Italy, Japan and the United States joined the Allies, while the Ottoman Empire and Bulgaria joined the Central Powers.\nAmbiguous Question:\nhow many non-combatants died? Clarifying Question: ": ["\nWhat was the total number of civilian and military casualties of WWI?", "\nWhat was the total number of casualties (combatants and non-combatants) of World War I?"], "Story:\nCHAPTER XXXIV \nHistory:\n'Midst furs, and silks, and jewels' sheen, He stood, in simple Lincoln green, The center of the glittering ring; And Snowdon's knight is Scotland's king! --_Lady of the Lake_. \nAmbiguous Question:\nThe commencement of the following year was passed, on the part of the Americans, in making great preparations, in conjunction with their allies, to bring the war to a close. In the South, Greene and Rawdon made a bloody campaign, that was highly honorable to the troops of the latter, but which, by terminating entirely to the advantage of the former, proved him to be the better general of the two.  Clarifying Question: ": [" Who was the better general of the two, Greene or Rawdon?", " Who is the better general of the two mentioned in the passage, Greene or Rawdon?"], "Story:\nThere once was a doggy named Jack that was really bored. One day he was sitting on the sofa he thought to himself, \"Maybe I'll go for a ride.\" The dog put on his shoes and hat and walked out of the door. He began riding down the street and he saw a lot of funny things. He saw a pumpkin name Sue using toothpaste, a cat name Walt watching a movie and a bear name Phil cooking on a grill. On his drive back home he saw a rat name Randy, and a lion name Leo riding a bike. When the doggy got back home he wanted to write a book about all of the things that he saw. He went into his office and gathered the pen and paper, sat down and began writing. After hours of writing he felt that his leg was hurting from being bent under the table so long. He wrote his last sentence and got up to walk off the pain. The doggy cooked his dinner, ate, then went to bed and the next day he woke up and read his story and liked what he wrote so much that he thought he would write another story later that day.\nHistory:\nWhat was it's name?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What was the name of the dog in the story?", " What is the name of the dog in the story?"], "Story:\nCHAPTER XXIII \nHistory:\nAN ELECTION OF OFFICERS \nAmbiguous Question:\n\"Election of officers to-morrow!\"  Clarifying Question: ": [" What type of officers are being elected tomorrow?", " What type of officers are being elected tomorrow?"], "Story:\nTripoli, Libya (CNN) -- At first glance, \"Mahmoud\" would seem the perfect candidate to be a supporter of Moammar Gadhafi. \nHistory:\nHe has prospered during the Libyan leader's 41-year reign, first as a professional and later taking care of his deceased father's businesses. \nAmbiguous Question:\nBut, as with many things in Tripoli, a first glance can be deceiving.  Clarifying Question: ": [" What is Mahmoud's true opinion of Moammar Gadhafi?", " What is Mahmoud's true opinion of Moammar Gadhafi?"], "Story:\nJack woke up on a Saturday morning. He got out of bed and went to the bathroom, and brushed his teeth. He put on his clothes and walked to the kitchen. Jack had a few choices to pick for breakfast. He could choose between an apple, pear, cereal or eggs. He picked an apple to eat for breakfast. After his breakfast, he turned on the TV to find something to watch. He could watch sports, the news, the weather or a cooking show. He chose to watch the weather. The reporter said fall was coming but that the weather was getting warmer instead of cooler. He turned off the TV and went outside to the backyard. Jack wanted to make some hot dogs for lunch the next day. He went to the store to get hot dogs, mustard, and ketchup. After coming back home from the store, Jack made lunch. After lunch, he found that he needed to do some cleaning. He started cleaning the kitchen and moved on to the living room.\nHistory:\nDid he take a nap after his meal?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Did Jack take a nap after he finished eating lunch?", " Did Jack take a nap after he finished eating his lunch?"], "Story:\nJack woke up on a Saturday morning. He got out of bed and went to the bathroom, and brushed his teeth. He put on his clothes and walked to the kitchen. Jack had a few choices to pick for breakfast. He could choose between an apple, pear, cereal or eggs. He picked an apple to eat for breakfast. After his breakfast, he turned on the TV to find something to watch. He could watch sports, the news, the weather or a cooking show. He chose to watch the weather. The reporter said fall was coming but that the weather was getting warmer instead of cooler. He turned off the TV and went outside to the backyard. Jack wanted to make some hot dogs for lunch the next day. He went to the store to get hot dogs, mustard, and ketchup. After coming back home from the store, Jack made lunch. After lunch, he found that he needed to do some cleaning. He started cleaning the kitchen and moved on to the living room.\nHistory:\nIs that it?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" Is Jack done with his cleaning or is there something else he needs to do?", " What did Jack do after he finished cleaning the living room?"], "Story:\n(CNN) -- Gordon Stoker, who as part of the vocal group the Jordanaires sang backup on hits by Elvis Presley, Patsy Cline, George Jones and countless others, died Wednesday at his home in Brentwood, Tennessee. He was 88. \nHistory:\nHis death was confirmed by the group's website. \nAmbiguous Question:\nFor many years, the Jordanaires were Elvis' go-to backup singers, performing on hits including \"Hound Dog,\" \"Are You Lonesome Tonight\" and \"Crying in the Chapel.\"  Clarifying Question: ": [" How long had the Jordanaires been singing backup for Elvis Presley?", " What year did the Jordanaires first collaborate with Elvis Presley?"], "Story:\n(CNN) -- He was the soccer referee known as \"golden whistle\" who officiated in high-profile events such as the World Cup and the Olympics. \nHistory:\nBut a Chinese court has called fulltime on Lun Ju's career by jailing him for match fixing. \nAmbiguous Question:\nChina's state news agency Xinhua reported on Thursday that Lu has been sentenced to five and a half years in prison by a court in Liaoning Province after accepting $128,000 to fix seven matches in China's national league.  Clarifying Question: ": [" What was the exact amount of money that Lu accepted to fix the seven matches?", " What was the nature of the match fixing Lu was convicted of?"], "Story:\nA family of four went to the zoo today. The animal zoo they were going to had a bunch of different kinds of animals! The kids were so excited to go that they had almost forgot to bring their camera. They arrived to the zoo and the first thing they saw were the flamingos! They were so pretty and pink. They all stood around very silently and looked at the people. The next animal they saw were the lions. They were so scary looking that the kids were scared to walk close to the fence. After the lions were the giraffes. They were so tall, the kids had to lean all the way back to see them. The kids were hungry so they went to go eat lunch. The family had a bunch of food such as pizza, burgers, chicken fingers, and fries. After lunch, they went to see the monkeys. They were so loud and smelly. Some of the monkeys went right up to the glass to look at the people. The family took a break after seeing the monkeys as they were tired from all the walking. The park was so big that they had so many more animals to see! Their feet started hurting, so the family went to see a few more animals. They went home after a really fun day at the zoo. They had seen a lot of animals they never would have seen outside of the zoo. They loved the zoo so much they wanted to go back next week! The parents said they would come back soon to see how the animals were doing.\nHistory:\nThen what?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" What happened after the family decided to go back to the zoo the following week?", " What happened after the family went home from the zoo?"], "Story:\nBill Gates was born on October 28, 1955. He grew up in Seattle, Washington. He was a very clever boy. His favorite subjects at school were science and math. When he was 13, he started to play with computers. At that time, computers were large machines. Once he was very interested in a very old computer. He and some of his friends spent lots of time doing unusual things with it. In the end, they worked out a software program with the old machine. Bill sold it for $4,200 when he was only 17. In 1973, Bill went to Harvard University . In his third school year, he left Harvard to work for a company called Microsoft. Bill began his company in 1975 with his friend Paul Allen. They thought the computer would come into every office and every home soon. So they began developing the software forpersonalcomputers. They improved the software to make it easier for people to use computers.\nHistory:\nat what age did he start to play with computers?\nAmbiguous Question:\nAmbiguous Question: Clarifying Question: ": [" At what age did Bill Gates start to play with computers?", " At what age did Bill Gates start to play with computers?"], "Story:\nCHAPTER XXI \nHistory:\nTROUBLES IN THE FOLD--A MESSAGE \nAmbiguous Question:\nGabriel Oak had ceased to feed the Weatherbury flock for about four-and-twenty hours, when on Sunday afternoon the elderly gentlemen Joseph Poorgrass, Matthew Moon, Fray, and half-a-dozen others, came running up to the house of the mistress of the Upper Farm.  Clarifying Question: ": [" What caused the elderly gentlemen to come running to the mistress of the Upper Farm?", " What event caused the elderly gentlemen to come running up to the house of the mistress of the Upper Farm?"], "Story:\nMax is a very happy cow. He's dark brown, with big blue eyes, and a soft pink nose. He lives in a huge field during the summer, with beautiful, and tasty, buttercups and hay. During the winter he lives in a nice, warm barn. \nHistory:\nThe hay isn't as tasty then, but it keeps him fed until summer comes back. One winter day Max wanted to see what was happening outside when it turned cold and bright. He had never gone out during the winter because the Farmer always locked the barn door behind him. But today the door was wide open, and Max could see the sunshine reflecting off the bright ground. He had to know why! So Max pushed open the gate to his little house with his nose and walked over to the door. Max was surprised and confused by the ground outside, it was so white and sparkly. His breath started fogging in the air, and the ground was cold and crunchy. \"What is this?\" He asked the rooster sitting on the fence. The roosters name was Omaha, and he was all white except for a big red puff on his head. \nAmbiguous Question:\n\"It's snow, son! Did you grow up in a barn?!\" The rooster laughed and flew away towards his little rooster house.  Clarifying Question: ": ["\nWhat is snow and why is it making the ground cold and crunchy?", "\nWhat did Omaha mean when he asked if Max had grown up in a barn?"], "Story:\nEaster Island is a Chilean island in the southeastern Pacific Ocean, at the southeasternmost point of the Polynesian Triangle in Oceania. Easter Island is famous for its 887 extant monumental statues, called \"moai\", created by the early Rapa Nui people. In 1995, UNESCO named Easter Island a World Heritage Site, with much of the island protected within Rapa Nui National Park. \nHistory:\nPolynesian people most likely settled on Easter Island sometime between 700 and 1100 CE, and created a thriving and industrious culture as evidenced by the island's numerous enormous stone \"moai\" and other artefacts. However, human activity, the introduction of the Polynesian rat and overpopulation led to gradual deforestation and extinction of natural resources which severely weakened the Rapa Nui civilization. By the time of European arrival in 1722, the island's population had dropped to 2,000–3,000 from an estimated high of approximately 15,000 just a century earlier. European diseases and Peruvian slave raiding in the 1860s further reduced the Rapa Nui population, to a low of only 111 inhabitants in 1877. \nAmbiguous Question:\nEaster Island is one of the most remote inhabited islands in the world. The nearest inhabited land (around 50 residents in 2013) is Pitcairn Island, away; the nearest town with a population over 500 is Rikitea, on the island of Mangareva, away; the nearest continental point lies in central Chile, away. Clarifying Question: ": ["\nHow far away is Pitcairn Island from Easter Island?", "\nWhat is the approximate distance between Easter Island and Pitcairn Island?"], "Story:\nThe International Criminal Court (ICC or ICCt) is an intergovernmental organization and international tribunal that sits in The Hague in the Netherlands. The ICC has the jurisdiction to prosecute individuals for the international crimes of genocide, crimes against humanity, and war crimes. The ICC is intended to complement existing national judicial systems and it may therefore only exercise its jurisdiction when certain conditions are met, such as when national courts are unwilling or unable to prosecute criminals or when the United Nations Security Council or individual states refer situations to the Court. The ICC began functioning on 1 July 2002, the date that the Rome Statute entered into force. The Rome Statute is a multilateral treaty which serves as the ICC's foundational and governing document. States which become party to the Rome Statute, for example by ratifying it, become member states of the ICC. Currently, there are 124 states which are party to the Rome Statute and therefore members of the ICC. However, Burundi has given formal notice that it will withdraw from the Rome Statute. \nHistory:\nThe ICC has four principal organs: the Presidency, the Judicial Divisions, the Office of the Prosecutor, and the Registry. The President is the most senior judge chosen by his or her peers in the Judicial Division, which hears cases before the Court. The Office of the Prosecutor is headed by the Prosecutor who investigates crimes and initiates proceedings before the Judicial Division. The Registry is headed by the Registrar and is charged with managing all the administrative functions of the ICC, including the headquarters, detention unit, and public defense office.\nAmbiguous Question:\nWhere is it located? Clarifying Question: ": ["\nWhere is the International Criminal Court located?", "\nWhere is the International Criminal Court located?"], "Story:\n(CNN) -- Iggy Azalea would love it if everyone channeled \"Frozen\" and just \"let it go.\" \nHistory:\nThe Australian rapper has broken her silence about a supposed feud between herself and Nicki Minaj, rumors that were sparked after Minaj gave a curiously pointed acceptance speech at the BET Awards on Sunday. \nAmbiguous Question:\nThe New York-bred MC made it clear that when \"you hear Nicki Minaj spit, Nicki Minaj wrote it,\" leaving observers to assume that she was taking a dig at Azalea, who's been rumored to work with ghostwriters and was Minaj's competitor at the awards ceremony.  Clarifying Question: ": [" What did Nicki Minaj say in her acceptance speech at the BET Awards?", " What were the rumors that were sparked after Nicki Minaj gave her acceptance speech at the BET Awards?"], "Story:\nThree Boys and a Dad \nHistory:\nBrad closed the door slowly as Sue left home to visit her mother.Expecting a whole day to relax,he was thinking whether to read the newspaper or watch his favourite TV talk show on his first day off in months.\"This will be like a walk in the park,\"he'd told his wife.\"I'll look after the kids,and you can go visit your mom.\" \nAmbiguous Question:\nThings started well,but just after eight o'clock,his three little \"good kids\"--Mike,Randy,and Alex--came down the stairs in their night clothes and shouted \"breakfast,daddy.\"When food had not appeared within thirty seconds,Randy began using his spoon on Alex's head as if it were a drum.Alex started to shout loudly in time to the beat .Mike chanted \"Where's my toast,where's my toast\" in the background.Brad realised his newspaper would have to wait for a few seconds.  Clarifying Question: ": [" Who are the three boys in the story?", " Who are the three boys mentioned in the story?"], "Story:\nAviation is the practical aspect or art of aeronautics, being the design, development, production, operation and use of aircraft, especially heavier than air aircraft. The word \"aviation\" was coined by French writer and former naval officer Gabriel La Landelle in 1863, from the verb \"avier\" (synonymous flying), itself derived from the Latin word \"avis\" (\"bird\") and the suffix \"-ation\". \nHistory:\nThere are early legends of human flight such as the story of Icarus in Greek myth and Jamshid in Persian myth, and later, somewhat more credible claims of short-distance human flights appear, such as the flying automaton of Archytas of Tarentum (428–347 BC), the winged flights of Abbas Ibn Firnas (810–887), Eilmer of Malmesbury (11th century), and the hot-air Passarola of Bartholomeu Lourenço de Gusmão (1685–1724). \nAmbiguous Question:\nThe modern age of aviation began with the first untethered human lighter-than-air flight on November 21, 1783, of a hot air balloon designed by the Montgolfier brothers. The practicality of balloons was limited because they could only travel downwind. It was immediately recognized that a steerable, or dirigible, balloon was required. Jean-Pierre Blanchard flew the first human-powered dirigible in 1784 and crossed the English Channel in one in 1785.  Clarifying Question: ": ["\nWhat was the name of the first human-powered dirigible to cross the English Channel?", "\nWhat is the origin of the word \"aviation\"?"], "Story:\n(CNN) -- Money talks -- that's hardly a revelation, but the overriding feeling towards Saturday's David Haye versus Dereck Chisora \"circus fight\" in London is shock and outrage that it could even take place. \nHistory:\nWith neither fighter holding a British boxing license, promoter Frank Warren had to resort to asking the little-known Luxembourg federation to sanction the bout. \nAmbiguous Question:\nIt has since been expelled from the European Boxing Union for agreeing to give legitimacy to an event that no-one else would touch.  Clarifying Question: ": [" What was the consequence of the Luxembourg federation sanctioning the fight between David Haye and Dereck Chisora?", " What was the outcome of the European Boxing Union's decision to sanction the David Haye versus Dereck Chisora fight?"]}